/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：对主函数main()中数组a进行处理:如果相邻元素相同则保留
      一个。例如对数组a处理后，它的前11个元素为
      {-5,7,-4,25,0,2,4,16,8,5,20}。

---------------------------------------------------------
注意：请勿改动主函数main()中的其他内容。
-------------------------------------------------------*/

#include <stdio.h>
#include <conio.h>

int main(){
    int a[20]={-5,-5,7,-4,-4,25,25,0,0,0,2,4,16,16,8,5,5,5,5,20};
    int i,prev,next;
    prev=0;
    next=1;
    while(next<20){
/***********SPACE***********/
        if(a[prev]!=【?】)
            a[++prev]=a[next];
        next++;
    }
/***********SPACE***********/
    for(i=0;i【?】prev;i++)
        printf("%d ",a[i]);
    printf("\n");
    getch();
    return 0;
}