/*----------------------------------------------------------------------
【程序填空】
---------------------------------------------------------------------------
题目：计算整型数组a中相邻两元素的最大公约数和最小公倍数，其中求两数的最大
      公约数需调用函数gcd(int a,int b)。

例如：main函数中a数组的元素为        8  12  5  7  14
      程序执行后b数组的元素为        4  1   1  7  2
      程序执行后c数组的元素为        24 60  35 14 56
-----------------------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
----------------------------------------------------------------------*/
#include<stdio.h>
int gcd(int a,int b)
{
    while(a-b)
    {
        if(a>b)
            a=a-b;
        else
/**************************SPACE*************************/
            【?】;
    }
    return a;
}
int main()
{ 
    int a[5]={8,12,5,7,14};
    int b[5],c[5];
    int i;
    for(i=0;i<5;i++)
        printf("%d\t",a[i]);
    printf("\n");
    for(i=0;i<5;i++)
    {
        b[i]=gcd(a[i],a[(i+1)%5]);
/**************************SPACE*************************/
        c[i]=【?】;
    }
    for(i=0;i<5;i++)
        printf("%d\t",b[i]);
    printf("\n");
    for(i=0;i<5;i++)
        printf("%d\t",c[i]);
    printf("\n");
    return 0;
}
