/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：下面程序中，函数fun的功能是：在任意给定的9个正整数中
      找出按升序排列时处于中间的数，将原数据序列中比该中间
      数小的数用该中间数替换，位置不变，在主函数中输出处理
      后的数据序列，并将中间数作为函数值返回。
　　  例如，有9个正整数：1 5 7 23 87 5 8 21 45
　　  按升序排列时的中间数为：8
　　  处理后主函数中的输出为：8 8 8 23 87 8 8 21 45

下面给定的程序存在错误，请改正。

---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/

#include <stdio.h>
#define  N  9
int find(int []);
void sort(int []);
void main()
{ 
    int i, x[N]={1,5,7,23,87,5,8,21,45};
    for(i=0; i<9;i++)
        printf("%5d",x[i]);
    printf("\n");
/***********FOUND***********/  
    printf("The mid number is:%5d\n",find(x[]));
    for(i=0; i<9;i++)
        printf("%5d",x[i]);
    printf("\n");
}
int find(int x[])
{  
    int i,mid,b[N];
    for(i=0;i<N;i++)
        b[i]=x[i];        
    sort(b);
    mid=b[N/2];
    for(i=0; i<N;i++)
/***********FOUND***********/
        if(x[i] < mid) mid=x[i];
    return  mid;
}

void sort(int b[])
{
    int i,j,k,t;
    for(i=0;i<N;i++)
    {  
        k=i;
        for(j=i+1;j<N;j++)
/***********FOUND***********/
            if(b[k]<b[j]) k=j;
        if(k != i )
        {  
            t=b[i]; b[i]=b[k]; b[k]=t;
        }
    }
}