/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

    函数void rearr(int a[], int n)将已经升序排列的一维数
    组a中的n个元素重新排列,重新排列的规则是：
    将a数组中的最小元素放到a[0],最大元素放到a[1]，
    将次小元素放到a[2],次大元素放到a[3]，...，
    以此类推。

    例如:
    原a数组各元素为：
        -11 -7 0 3 8 15 16 20 38
    重新排列后a数组各元素为：
        -11 38 -7 20 0 16 3 15 8

---------------------------------------------------------
注意：请勿改动程序中的其他内容。
-------------------------------------------------------*/

#include<stdio.h>
#define N 9
void rearr(int a[], int n)
{
    int left,right,i;
    int b[N];
    left=0;
    right=N-1;
    for(i=0; left<right; i+=2)
    {
        b[i]=a[left++];
/**************************SPACE*************************/
        b[i+1]=a[【?】];
    }
    if(left==right)
        b[i]=a[left];
    for(i=0;i<N;i++)
/**************************SPACE*************************/
        a[i]=【?】;
}
int main()
{
    int i,a[N]={-11,-7,0,3,8,15,16,20,38};
    rearr(a,N);
    for(i=0;i<N;i++)
        printf("%3d",a[i]);
    printf("\n");
    return 0;
}