/*-------------------------------------------------------------------------
【程序设计】
---------------------------------------------------------------------------
题目：小明把老师布置的算术题写在了字符串中。请您帮助小明编写程序先将形如
      “ 15*3 ”的子串转换为15,3,'*'，再计算15乘3的结果。

例如：小明写的字符串为“  15*3  15+3  15/3  15-3  ”

程序运行结果为：
15*3=45
15+3=18
15/3=5
15-3=12

编写程序：
1.编写 int change(char s[],int num[][3],char op[])函数，将s中所有形如
  “ 15*3 ”的子串转换为15,3,'*'，其中运算数15,3存放在num数组同一行
  的前2列，运算符'*'存放在op数组中。函数返回形如“ 15*3 ”的子串个数。

2.编写 void calc(int num[][3],char op[],int n)函数，根据op数组中运算符号，
  对num数组中前2个元素进行相应的运算，运算结果保存在num数组同一行的第3列。
  参数n表示num数组中保存了n行数据，op数组中保存了n个运算字符。

--------------------------------------------------------------------------
注意：请勿改动主函数main()中的任何语句。
-------------------------------------------------------------------------*/

#include<stdio.h>
#include<stdlib.h>
#include<ctype.h> 
#define N 10  
int change(char s[],int num[][3],char op[])
{
/**********Program**********/




/**********  End  **********/
}
void calc(int num[][3],char op[],int n)
{
/**********Program**********/




/**********  End  **********/
}
int main()
{
    char s[]={"   15*3  15+3  15/3  15-3   "};
    int num[N][3],i,n;
    char op[N];
    FILE *fp;
    if((fp=fopen("DATA.TXT","w"))==NULL)
    {
        printf("File open error\n");
        exit(0);
    }
    n=change(s,num,op);
    calc(num,op,n);
    for(i=0;i<n;i++)
    {
        printf("%d%c%d=%d\n",num[i][0],op[i],num[i][1],num[i][2]);
        fprintf(fp,"%d%c%d=%d\n",num[i][0],op[i],num[i][1],num[i][2]);
    }
    fclose(fp);
    return 0;
}