/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：求数组a[5]中相邻元素的最大公约数，并保存到数组b[5]中
      (a[4]与a[0]看作相邻元素)。

例如：a[5]={18,66,38,87,15}
      b[5]={6,2,1,3,3}
      
---------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
      且不能使用C语言的库函数
-------------------------------------------------------*/

#include <stdio.h>
void Calculate(int a[],int n,int b[])
{
    int i,x,y,r;
    for(i=0;i<n;i++)
    {
        x=a[i];
/***********SPACE***********/
        y=a[【?】];
        do
        { 
/***********SPACE***********/
            【?】;
            x=y;
            y=r;
        }while(r);
        b[i]=x;
    }
}
void  main()
{
    int  i,a[5]={18,66,38,87,15},b[5]={0};
    Calculate(a,5,b);
    printf("  数组元素:");
    for(i=0;i<5;i++)
        printf("%6d",a[i]);
    printf("\n最大公约数:");
    for(i=0;i<5;i++)
        printf("%6d",b[i]);
    printf("\n");



}
