/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：主函数main()中调用fun()函数，其中fun函数的功能是：生
      成杨辉三角形的前六行。形如：
       1
       1   1
       1   2   1
       1   3   3   1
       1   4   6   4   1
       1   5  10  10   5   1
      下面给定的程序存在错误，请改正。

---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/

#include <stdio.h>
#define N 6
/***********FOUND***********/
void yanghui(int a[N][])
{
    int i,j;
    for(i=0;i<N;i++)
    {
/***********FOUND***********/
        a[i][i]=1;a[0][i]=1;
    }
    for(i=2;i<N;i++)
/***********FOUND***********/
        for(j=1;j<i-1;j++)
            a[i][j]=a[i-1][j-1]+a[i-1][j];
}
int main()
{
    int i,j,a[N][N];
    yanghui(a);
    for(i=0;i<N;i++)
    {
        for(j=0;j<=i;j++)
            printf("%4d",a[i][j]);
        printf("\n");
    }
}
