
/*------------------------------------------------------------------------
【程序改错】
--------------------------------------------------------------------------
题目：一维数组中的元素互不相同时，数组可以视为集合。小明编写了函数f，使用2
      个这样的一维数组a、b，产生一维数组c，使得c数组也是一个集合，即c数组
      中的元素也互不相同，c包含了a中有、b中没有，或b中有、a中没有的全部元素。

测试数据为
                        a数组：12 0 -5 4 6 -8 
                        b数组：0 3 7 6
程序运行结果为：
                        c数组：12 -5 4 -8 3 7 

程序存在3个错误，请你帮他改正，使它能得出正确的结果
---------------------------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------------------------*/
#include <stdio.h>
#define A 6
#define B 4
int a[A]={12,0,-5,4,6,-8};
int b[B]={0,3,7,6};
int c[A+B];
int f()
{
    int i,j,k,C;
    for(i=0;i<A;i++)
        c[i]=a[i];
    C=A;
/***********FOUND***********/
    for(j=0;j<A;j++)
    {
        for(i=0;i<C;i++)
            if(b[j]==c[i])
                break;
            if(i<C)
            {
                for(k=i;k<C-1;k++)
                /***********FOUND***********/
                    c[k]=c[k-1];
                --C;
            }
            else
            {
                c[C]=b[j];
                ++C;
            }
    }
    return C;
}
void print(int m[],int n)
{
    int i;
    for(i=0;i<n;i++)
        printf("%4d\t",m[i]);
    printf("\n");
}
int main()
{
    int C;
    print(a,A);
    print(b,B);
    C=f();
/***********FOUND***********/
    print(c,A+B);
    return 0;
}
