/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：主函数main()调用fun()函数，其中fun函数的功能是：求
      表达式
        s=aa…aa-…-aaa-aa-a
        （此处aa…aa表示n个a，a和n的值为1~9）
      例如：a=3，n=6，则以上表达式为：
      s=333333-33333-3333-333-33-3
      其值是296298。其中a和n是fun函数的形参，表达式的值作
      为函数值返回main函数。

下面给定的程序存在错误，请改正。

---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/

#include<stdio.h>
long fun(int a,int n)
{
    int j;
/***********FOUND***********/
    long s=0,t=1;
    for(j=0;j<n;j++)
/***********FOUND***********/
        t=t+a*10;
    s=t;
    for(j=1;j<n;j++)
    {
/***********FOUND***********/
        t=t%10;
        s=s-t;
    }
    return s;
}

int main()
{
    int a,n;
    printf("Please enter a and n:");
    scanf("%d%d",&a,&n);
    printf("The value of function is %ld\n",fun(a,n));
    return 0;
}
