/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

    函数int convert(int a,int nsys)将nsys(nsys<10)进制数a，
    转换成十进制数并返回。

---------------------------------------------------------
注意：请勿改动程序中的其他内容。
---------------------------------------------------------*/

#include<stdio.h>
#define N 5
int convert(int a,int nsys)
{
    int t,p;
    if(a<nsys)
        return a;
    t=0;
    p=1;
    while(a!=0)
    {
        t=t+a%10*p;
/**************************SPACE*************************/
        【?】;
        p*=nsys;
    }
    return t;
}
int main()
{
    int i,d;
    int num[N][2]={{704,8},{10011,2},{266,7},{3,5},{22110,3}};
    for(i=0;i<N;i++)
    {
        d=convert(num[i][0],num[i][1]);
/**************************SPACE*************************/
        printf("%d进制数的%d\t = 十进制数的%d\n",【?】);
    }
    return 0;
}