/*------------------------------------------------------------------------
【程序改错】
--------------------------------------------------------------------------

题目：先将一个正整数转换为十进制表示的数字字符串，再将千位分隔符','插入到
      该字符串中，最后输出该字符串。

    测试数据：  1234567      1,234,567      
                 234567        234,567
                    567            567

请改正程序中的错误，使它能得出正确的结果。
--------------------------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
------------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
void change(char s[],long num)   
{  
    long i,j;
    i=0;
    while(num)
    {  
        j=0;
/***************FOUND***************/
        while(num || j<3)
        {
            s[i++]=num%10+48;
            num/=10;
            j++;
        }

        if(num) 
/***************FOUND***************/
            s[i]=',';
    }
    s[i]='\0';
}

void rever(char s[])        
{  
    char c;
    int left,right;
    left=0;
/***************FOUND***************/
    right=strlen(s);
    while(right>left)
    {    
        c=s[left];
        s[left++]=s[right];  
        s[right--]= c;
    }
}

int main( )
{
    int i;
    char s[20];  
    long  num[3]={1234567,234567,567};
    for(i=0;i<3;i++)
    {
        change(s,num[i]);
        rever(s);
        printf("%10d   %10s\n",num[i],s);
    }
    return 0;
}
