/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------
题目：void fun(char t[],int n)函数将字符串t中的n个字符按
      如下规则进行压缩，若有连续出现二个及以上相同的字符
      时，将这些连续的字符表示成m*x的形式（m为该字符，x
      为该字符出现的次数）。

例如：原字符串为"cccaeeeeebkkkkd"，经过压缩处理后的字符串
      为"c*3ae*5bk*4d"。

      请改正程序中的错误，使它能得出正确的结果。
---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
void fun(char t[],int n)
{
    int i,k,m,j;
    i=0;
    while(i<n-1)
    {
        k=i+1;
        while(t[k]==t[i])
            k++;
/***********FOUND***********/
        m=k-i+1;
        if(m>1)
        {
            for(j=i+1;k<=n;j++,k++)
                t[j]=t[k];
            n=n-m+1;
            for(j=n;j>i;j--)
/***********FOUND***********/
                t[j+1]=t[j];
            t[i+1]='*';
            t[i+2]=m+48; 
/***********FOUND***********/
            n=n+1;
            i+=3;
        }
        else
            i++;
    }

}

int main()
{
    char s[100]="cccaeeeeebkkkkd";
    int n;
    n=strlen(s);
    printf("压缩前的数据: ");
    puts(s);
    fun(s,n);
    printf("压缩后的数据: ");
    puts(s);
    return 0;
}