/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：任何一个大于4的偶数都可以表示成两个素数之和，输入一
      个偶数，为其寻找两个素数，这两个素数之和等于该偶数。
      例如：16=3+13,3和13都是素数。

---------------------------------------------------------
注意：请勿改动主函数main()中的其他内容。
-------------------------------------------------------*/

#include<stdio.h>
#include<math.h>
void main()
{
    void fun(int a);
    int a;
    do
    {
        printf("Please input a:");
        scanf("%d",&a);
    }while(a%2);
    fun(a);
}
void fun(int a)
{
    int b,c,d,y,i,j;
    for(i=3;i<=a/2;i=i+2)
    {
/***********SPACE***********/
        【?】
        for(j=2;j<=sqrt(i);j++)
            if(i%j==0) y=0;
        if(y==1)
        {
/***********SPACE***********/
            【?】
            for(j=2;j<=sqrt(d);j++)
                if(d%j==0) y=0;
            if(y==1)
            {b=i;c=d;printf("%d=%d+%d\n",a,b,c);break;}
        }
    }
}
