/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：统计从键盘输入的一行字符中单词的个数，单词之间用空
      格分开。

---------------------------------------------------------
注意：除要求填空的位置之外,请勿改动程序中的其他内容。
      且不能使用C语言的库函数进行填空。
-------------------------------------------------------*/

#include <stdio.h>

int word_stat(char string[])
{
    char c;
    int i,word=0;
    int wnum=0;
/***************SPACE***************/
    for (i=0;【?】;i++)
        if(c==' ') word=0;
        else if(word==0)
        {
            word=1;
            wnum++;
        }
/***************SPACE***************/
    【?】
}

void main()
{
    char string[100];
    printf("Please enter a string:\n");
    gets(string); 
    printf("The number of words is: %d\n",word_stat(string));
}