/*-------------------------------------------------------------------------
【程序改错】
---------------------------------------------------------------------------
题目：下列程序的功能是判断一个4阶对称方阵是否为双对称方阵。4阶对称方阵是指
      a[i][j]=a[j][i] (0<=i<=3,0<=j<=3)；4阶双对称方阵是指一个4阶对称方阵的
      第1列与第4列对换，第2列与第3列对换后，仍然是对称方阵。

函数int issym(int m[][N])的功能是判断二维数组m中存放的一个N阶方阵是否为
对称方阵，如果是则函数返回值1,否则返回值0。

函数void exchange(int a[][N])的功能是将二维数组a中存放的一个N阶方阵做横向翻
转，即:将矩阵的第1列与第N列对换,将第2列与第N-1列对换，...，直到N/2列为止。

程序运行结果是：
以下4阶方阵是对称方阵：
                      2      -1      2      -3        
                     -1       0      3       2
                      2       3      0      -1
                     -3       2     -1       2
是双对称方阵

请改正程序中的错误，使它能得出正确的结果。
---------------------------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
---------------------------------------------------------------------------*/

#include<stdio.h>
#define N 4
int issym(int m[][N])
{   
    int i,j;
    for(i=0;i<N-1;i++)
        for(j=i+1;j<N;j++)
/***********FOUND***********/
            if(m[i][j]==m[j][i])   
                return 0;
    return  1;
}

void exchange(int a[][N])
{   
    int i,j,t;
/***********FOUND***********/
    for(j=0;j<N;j++)
        for(i=0;i<N;i++)
        {   
            t=a[i][j];
            a[i][j]=a[i][N-j-1];   
            a[i][N-j-1]=t;
        }
}

int main()
{   
    int a[N][N]={{2,-1,2,-3},{-1,0,3,2},{2,3,0,-1},{-3,2,-1,2}};
    int i,j,r1,r2;
    
    printf("以下4阶方阵是对称方阵\n");
    for(i=0;i<N;i++)
    {  
        for(j=0;j<N;j++)
            printf("%4d",a[i][j]);
        printf("\n");
    }
    r1=issym(a);
    exchange(a);
    r2=issym(a);
/***********FOUND***********/
    if(r1+r2==0)
        printf("是双对称方阵\n");
    else
        printf("不是双对称方阵\n");
    
    return(0);
}
