/*-------------------------------------------------------------------------
【程序设计】
---------------------------------------------------------------------------
题目：小明定义了3条形如" 操作符 数字1 数字2 "的计算机指令，实现对一维数组元
      素的操作。其中操作符为1个大写字母，表示指令含义,数字1和数字2均为1位整
      数，表示一维数组元素下标。每条指令的3个符号之间均只有1个空格。

3条指令含义是：
              M指令："  M 0 3  ",表示将下标是3的元素赋给下标是0的元素
              E指令："  E 1 4  ",表示将下标是1的元素和下标是4的元素交换
              A指令："  A 7 5  ",表示将下标是5的元素累计到下标是7的元素中

              程序将上述指令转换为C语言语句。

编写程序：
1.函数void f1(char s[],char ins[][4])将字符串s[]=" M 0 3   E 1 4   A 7 5 " 
  分解为 "M03"、"E14"、"A75"，存储在ins中。

2.函数void f2(int a[],char ins[][4])依据ins中字母和数字字符的含义,
  对a数组中的有关元素进行相应操作。

测试数据
        a数组原始数据： 1 2 3 4 5 6 7 8
  程序运行后a数组数据： 4 5 3 4 2 6 7 14 

---------------------------------------------------------
注意：请勿改动主函数main()中的任何语句。
-------------------------------------------------------*/
#include<stdio.h>
#include<string.h>
#include<ctype.h>
#include<stdlib.h>

void f1(char s[],char ins[][4])
{
/**********Program**********/

        


/**********  End  **********/
}
void f2(int a[],char ins[][4])
{
/**********Program**********/




/**********  End  **********/
}
int main() 
{
    char s[]="  M 0 3    E 1 4    A 7 5  ",ins[3][4];
    int a[]={1,2,3,4,5,6,7,8};
    int i;
    FILE *fp;
    if((fp=fopen("DATA.dat","w"))==NULL)
    {
        printf("File insen error\n");
        exit(0);
    }
    for(i=0;i<8;i++)
    {
        printf("%4d",a[i]);
        fprintf(fp,"%4d",a[i]);
    }
    printf("\n");
    fprintf(fp,"\n");
    f1(s,ins);
    f2(a,ins);
    for(i=0;i<8;i++)
    {
        printf("%4d",a[i]);
        fprintf(fp,"%4d",a[i]);
    }
    printf("\n");
    fprintf(fp,"\n");
    fclose(fp);
    return 0;
}

