/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：主函数main()中二维数字字符串数组s为测试数据，程序将
      n个数字字符串转换为整数并输出，同时判断相邻两个整数
      是否是互满数对。

      互满数对是指如果数a的真因子之和等于数b，且数b的真因
      子之和等于数a，则称(a,b)为一对互满数。例如，(220,284)
      是一对互满数，因为220的真因子之和为
      284（1+2+4+5+10+11+22+44+55+110=284），
      且284的真因子之和为220（1+2+4+71+142=220）。

编写程序：
      1. 编写函数void chnum(char t[][20]，int n, int b[]),
         将n个数字字符串转换为整数，并保存到数组b中。

      2. 编写函数int allpairs(int b[],int n,int c[][2])，
         判断数组b中n个元素相邻的两个整数是否是互满数，将
         互满数对保存到数组c中，函数返回互满数对的个数。
      
      测试数据："2012","220","284","6232","6368"
      运行结果：
               (c[0][0],c[0][1])=(220,284)
               (c[1][0],c[1][1])=(6232,6368)

---------------------------------------------------------
注意：请勿改动主函数main()中的任何语句。
-------------------------------------------------------*/

#include<stdio.h>
#include<stdlib.h>
#include<conio.h>
#include<ctype.h>
#include<string.h>

void chnum(char t[][20],int n,int b[])
{
/**********Program**********/




/**********  End  **********/
}

int allpairs(int b[],int n,int c[][2])
{
/**********Program**********/




/**********  End  **********/
}

int main()
{
    char s[][20]={"2012","220","284","6232","6368"};
    int b[5]={0},n=5,i,num;
    int c[50][2];
    FILE *fp;
    if((fp=fopen("DATA.TXT","w"))==NULL)
    {
        printf("File open error\n");
        exit(0);
    }
    chnum(s,n,b);
    num=allpairs(b,n,c);
    for(i=0;i<num;i++)
    {
        printf("(c[%d][0],c[%d][1])=(%d,%d)\n",i,i,c[i][0],c[i][1]);
        fprintf(fp,"(c[%d][0],c[%d][1])=(%d,%d)\n",i,i,c[i][0],c[i][1]);
    }
    fclose(fp);
    getch();
    return 0;
}