/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：check()函数判断数组a中的n个元素经排序后，是否构成一
      个等差数列。
      例如数组元素4,7,9,5,6,8,10经升序排序后构成一个等差
      数列，而9,7,2,1,6经排序后不构成等差数列。
      所谓等差数列是指数列中所有相邻两数的差都相等。

请改正程序中的错误，使它能得出正确的结果。

---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/

#include <stdio.h>
int check(int a[],int n){
    int i,j,k,flag;
    for(i=0;i<n-1;i++){
        flag=0;
        for(j=n-1;j>i;j--)
            if(a[j]<a[j-1]){
                k=a[j];a[j]=a[j-1];a[j-1]=k;
                flag=1;
            }
/***********FOUND***********/
        if(flag)
            break;
    }
    for(i=1;i<n-1;i++)
/***********FOUND***********/
        if(a[i]-a[i-1]==a[i+1]-a[i])
            break;
/***********FOUND***********/
    if(i<=n-1)
        return 0;
    return 1;
}
int main(){
    int a[]={4,7,9,5,6,8,10},b[]={9,7,2,1,6};
    int i,v;
    v=check(a,7);
    for(i=0;i<7;i++)
        printf("%d\t",a[i]);
    printf("%s等差级数\n",v==1? "是":"不是");
    v=check(b,5);
    for(i=0;i<5;i++)
        printf("%d\t",b[i]);
    printf("%s等差级数\n",v==1? "是":"不是");
    return 0;
}