/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：fun()函数找出一维数组a中最大、最小值元素，并将最大
      值元素与数组的首元素交换，最小值与数组的最后一个元
      素交换。

请改正程序中的错误，使它能得出正确的结果。

---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/

#include <stdio.h>
#define N 10
void fun(int a[]){
    int pmax,pmin,i,t;
/***********FOUND***********/
    pmax=pmin=1;
    for(i=1;i<N;i++){
        if(a[i]>a[pmax])pmax=i;
        if(a[i]<a[pmin])pmin=i;
    }
    t=a[0];a[0]=a[pmax];a[pmax]=t;
/***********FOUND***********/
    if(pmin==N-1)
        pmin=pmax;
/***********FOUND***********/
    t=a[N-1];a[N-1]=a[pmax];a[pmax]=t;
}
void main(){
    int a[N]={-10,12,1,0,-15,14,19,24,7,30};
    int i;
    for(i=0;i<N;i++)
        printf("%d\t",a[i]);
    printf("\n");
    fun(a);
    for(i=0;i<N;i++)
        printf("%d\t",a[i]);
    printf("\n");
}