/*-------------------------------------------------------------------------
【程序改错】
---------------------------------------------------------------------------
题目：main函数随机产生10个互不相同的两位正整数，并保存在数组a中。找出数组a
      中的最小数和最大数，将最小数移到第一个整数之前，将最大数移到最后一个
      整数之后，其他整数保持相对存储位置不变。

例如：产生的随机数: 18  49  90  52  92  71  10  46  28  44
      处理后的数据: 10  18  49  90  52  71  46  28  44  92  

请改正程序中的错误，使它能得出正确的结果。
---------------------------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------------------------*/

#include <stdio.h>
#include <stdlib.h>
#include <time.h>
void crl(int a[],int n)
{        
    int i,j,max=0,min=0,temp;
    for(i=1; i<n ; i++)
        if(a[min]>a[i])
            min=i;
    temp=a[min];
    j=min;
    while(j>0)        
    {        
/***********FOUND***********/
        a[j]=a[j+1];
        j--;
    }
    a[0]=temp;
    for(i=1; i<n ; i++ )
        if(a[max]<a[i])
            max=i;
    temp=a[max];
    j=max;
    while(j<n-1 )
    {                
        a[j]=a[j+1];
        j++;
    }       
/***********FOUND***********/
    a[n]=temp;
}

int main()
{        
    int n[100]={0},a[10],i=0,k;
    srand((unsigned)time(NULL));        
    while(i<10)
    {        
        do
        {
/***********FOUND***********/
            k=rand()%100;        
        }while(n[k]);
        n[k]=1;
        a[i++]=k;
    }
    for(i=0; i<10 ; i++ )
        printf("%5d",a[i]);
    printf("\n");
    crl(a,10);
    for(i=0; i<10 ; i++ )
        printf("%5d",a[i]);
    printf("\n");
    return 0;
}
