/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：void superprime(int x[],int n)函数对x数组中的n个元
      素从后往前查找超级素数。每找到一个超级素数后，将其
      移到数列前面，并且该数移动后位置不再发生变化。

      超级素数是指该素数从低位到高位依次去掉一位数字之后
      剩下的数仍然是素数。例如，数739、73、7均为素数，故
      739是一个超级素数。
     
      int prime(int n)函数判定一个数是否为素数。

例如：原a数组元素为：1,2,29,32,59,199,209,739
      查找到的第一个超级素数为739，把739移动后数组元素为：
           739,1,2,29,32,59,199,209
      查找到的第二个超级素数为59，把59移动后数组元素为： 
           739,59,1,2,29,32,199,209
                  ..........   
      最后a数组各元素为：739,59,29,2,1,32,199,209

      请改正程序中的错误，使它能得出正确的结果。
---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/
#include<stdio.h>
#define N 8
int prime(int n)
{
    int i;
/***************FOUND****************/
    if(n==2) return 0;
    for(i=2;i<n;i++)
        if(n%i==0)return 0;
    return 1;
}

void superprime(int x[],int n)
{
    int i,j,k,m,flag,t;
    for(i=n-1,k=0;i>=k;i--)
    {
        t=x[i];flag=1;
        while(t&&flag)
        {
/***************FOUND****************/
            if(prime(t)) flag=0;
            t/=10;
        }
        if(flag)
        {
            m=x[i];
/***************FOUND****************/
            for(j=i;j>=0;j--)
                x[j]=x[j-1];
            x[j]=m;
            k++;i++;
        }
    }
}

int main()
{
    int i,a[N]={1,2,29,32,59,199,209,739};
    printf("移动前的数据: ");
    for(i=0;i<N;i++)
        printf("%6d",a[i]);
    printf("\n");
    superprime(a,N);
    printf("移动后的数据: ");
    for(i=0;i<N;i++)
        printf("%6d",a[i]);
    printf("\n");
    return 0;
}