/*------------------------------------------------------------------------
【程序改错】
--------------------------------------------------------------------------

题目：下列给定程序中，函数mov的功能是将指定字符串中下标为奇数的字符右移到
      下一个奇数位置，最右边被移出字符串的字符绕回放到第一个奇数位置，下
      标为偶数的字符不动（注：字符串的长度大于等于2）；

例如：字符串为：acegikmo    执行结果：aoecigmk

--------------------------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
------------------------------------------------------------------------*/
#include <stdio.h>
void mov(char s[])
{
    int i,n,k;
    char c;
    n=0;
    for(i=0;s[i]!='\0';i++) 
        n++;
    if(n%2==0)
/***********FOUND***********/
        k=n;
    else
        k=n-2;
    c=s[k];
    for(i=k-2;i>=1;i=i-2)
/*********************FOUND*******************/
        s[i]=s[i-2];
/*********************FOUND*******************/
    s[0]=c;
}
int main()
{
    char s[100]={"acegikmo"};
    printf("\n The original string is:%s\n",s);
    mov(s);
    printf("\n the result is:%s\n",s);
    return 0;
}