/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：在区间[10,99]中，找出所有符合如下条件的数，该数与其
      逆序数均是素数。

例如：13是素数，13的逆序数31也是素数。

---------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
      且不能使用C语言的库函数
-------------------------------------------------------*/

#include<stdio.h>
#include<math.h>
#define  N  20
int isprime(int n)
{
    int i,k=(int)sqrt(n);
/***********SPACE***********/
    for(i=2; i <= k && 【?】 ;i++)
    ;
/***********SPACE***********/
        return  【?】 ;
}
int  reverse(int  n)
{
    int m=0;
    while(n)
    {
        m=m*10+n%10;
        n/=10;
    }
    return  m;
}

void  main()
{
    int i,j,k=0,a[N];
    for(i=10;i<100;i++)
        if(isprime(i) && isprime(reverse(i)))
            a[k++]=i;
    for(i=0;i<k;i++)
        printf("%6d",a[i]);
    printf("\n");
}
