/*-------------------------------------------------------------------------
【程序填空】
---------------------------------------------------------------------------
题目：main函数中a数组的n个元素互不相同。函数insert(int a[],int n,int x)的
      功能是：在一维有序数组a中插入x，插入x后数组a仍保持原来的有序性。

例如：调用insert函数前，main函数中a数组的元素为      12  9  4  3  0  -5
      当x的值为1时，调用insert函数后，a数组的元素为  12  9  4  3  1   0  -5

      调用insert函数前，main函数中b数组的元素为     -10  -4  2  7
      当x的值为1时，调用insert函数后，b数组的元素为 -10  -4  1  2  7
--------------------------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
-------------------------------------------------------------------------*/

#include<stdio.h>
void insert(int a[],int n,int x)
{
    int i;
    int flag;
    flag=a[0]>a[1];
/**************************SPACE*************************/
    for(i=n-1; i>=0 && (【?】? x<a[i] : x>a[i]) ; --i )
        a[i+1]=a[i];
/**************************SPACE*************************/
    【?】;
}
void print(int a[],int n)
{
    int i;
    for(i=0;i<n;++i)
        printf("%d\t",a[i]);
    printf("\n");
}
int main()
{ 
    int a[10]={12,9,4,3,0,-5};
    int b[10]={-10,-4,2,7};
    int n,m,x;
    n=6,m=4,x=1;
    print(a,n);
    insert(a,n++,x);
    print(a,n);
    print(b,m);
    insert(b,m++,x);
    print(b,m);
    return 0;
}