/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：函数main()首先产生N个随机数，再调用insertsort()函数
      对这N个数按升序进行排序，最后将排序的结果输出。

下面给定的程序存在错误，请改正。

---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/

#include <stdio.h>
#include <stdlib.h>
#define N 20

void insertsort(int  R[],int n)
{        int i,j;
        int temp;
/***********FOUND***********/
        for  (i=1;i<=n;i++) 
        { 
                temp=R[i];  
                j=i-1;
/***********FOUND***********/
                while((j>0)&&(temp<R[j]))        
                {
                        R[j+1]=R[j];j--; 
                }
/***********FOUND***********/
                R[j+1]=R[i]; 
        }
}

void print(int R[],int n)
{        int i;
        for(i=0;i<=n-1;i++)        {
                if(i%10==0)        printf("\n");
                printf("%6d",R[i]);
        }
        printf("\n");
}

main()
{
        int T[N];
        int i;
        for(i=0;i<=N-1;i++)
                T[i]=rand();    // 产生随机数
        print(T,N);             // 输出随机数
        insertsort(T,N);
        print(T,N);             // 输出排序后的随机数
}