/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：函数main()首先从键盘接收一串字符，以回车符结束串输入，
      并保存在变量str1中，输入一个字符给变量ch；其次，调用
      fun()函数将字符串str1中的所有为ch字符去掉；最后输出字
      符串str1。

下面给定的程序存在错误，请改正。

---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/

#include <stdio.h>
void fun(char str[], char ch)
{
        int i=0, j=0;
        while (str[i]!=0)
        {
                if (str[i] != ch)
                {
/***********FOUND***********/
                        str[j++]=str[i++];
                }
                i++;
        }
/***********FOUND***********/
        str[i]='\0';
}

main()
{
        char str1[200], ch;
        int i=0;
/***********FOUND***********/
        while(str1[i]=getchar()!='\n') 
                i++;
        str1[i] = '\0';
        scanf("%c",&ch);
        fun(str1,ch);
        printf("%s\n",str1);
        return 0;
}