/*-------------------------------------------------------------------------
【程序设计】
---------------------------------------------------------------------------
题目： 数组a[N][M]中的每行存放一组二进制字符，将每行的二进制字符转换为十进
       制数存放到数组b中，然后找出b中每个偶数的所有哥德巴赫猜想组合。
       哥德巴赫猜想：任意一个大于2的偶数都可以分解成两个素数之和。 

       函数change(char a[][M],int b[])将a中每行二进制字符串转换成十进制整数
       存放在数组b中。
            
       函数find(int x, int c[][2])找出偶数x的所有哥德巴赫猜想组合并
       存入c中，函数返回c的行数。          
        
       输出结果：
                26=3+23
                26=7+19
                26=13+13
                100=3+97
                100=11+89
                100=17+83
                100=29+71
                100=41+59
                100=47+53
                105是奇数
                32=3+29
                32=13+19
                24=5+19
                24=7+17
                24=11+13
---------------------------------------------------------
注意：请勿改动主函数main()中的任何语句。
-------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#define N 5
#define M 20 
void change(char a[][M],int b[]) {
/**********Program**********/




/**********  End  **********/
}

int find(int x, int c[][2]) { 
/**********Program**********/




/**********  End  **********/
}

int main() {
    char a[N][M]= {"11010","1100100","1101001","100000","11000"};
    int b[N],c[200][2],n,i,j;
    FILE *fp;
    if((fp=fopen("DATA.dat","w"))==NULL) {
        printf("File open error \n" );
        exit(0);
    }
    change(a,b);
    for(i=0; i<N; i++) {
        if (b[i]%2){
            printf("%d是奇数\n",b[i]);                        
            fprintf(fp,"%d是奇数\n",b[i]);                            
        }else if (b[i]<=2 ) { 
            printf("%d小于等于2\n",b[i]);
            fprintf(fp,"%d小于等于2\n",b[i]); 
        }else { 
            n=find(b[i],c);
            for(j=0; j<n; j++) { 
               printf("%d=%d+%d\n",b[i],c[j][0],c[j][1]);                
               fprintf(fp,"%d=%d+%d\n",b[i],c[j][0],c[j][1]);                
            }
        }                
    }
    fclose(fp);
    return 0;
}