/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：对只包含'-'和字母字符的字符串str进行如下处理：
      删除str中前导和尾部连续的'-'字符，保留串中字母字符以
      及字母间的'-'字符。
      例如，str中初始字符串为"----C--Language--Test----"。
      处理后，str中的字符串为"C--Language--Test"。
      程序中isalpha函数功能是判断参数是否是字母，是字母，
      函数值为真，否则函数值为假。

---------------------------------------------------------
注意：请勿改动主函数main()中的其他内容。
-------------------------------------------------------*/

#include <ctype.h>
#include <stdio.h>

void main()
{
	char str[] = {"---C--Language--Test---"};
	int i, start, end;
	i = 0;
	while (str[i++] == '-')
		;
	start = i - 1;
	/***********SPACE***********/
  while(str[i] != 【?】){
	  if (isalpha(str[i]))
		  end = -1;
	  else if (isalpha(str[i - 1]))
		  end = i - 1;
	  i++;
  }
  str[end + 1] = '\0';
  for (i = start; i <= end + 1; i++)
	  /***********SPACE***********/
	str[i-【?】] = str[i];
  printf("%s\n", str);
}