/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

    函数int change(char s[])将s中的数字字符串转换成整数，
    并返回该数。例如s[]中为"123"，转换后为123。

    函数int multi(char s[],char t[])将s字符串转换的整数乘
    以t字符串转换的整数，并返回乘积。

---------------------------------------------------------
注意：请勿改动程序中的其他内容。
-------------------------------------------------------*/

#include<stdio.h>
int change(char s[])
{
    int i,sum;
    sum=0;
    for(i=0;s[i];i++)
/**************************SPACE*************************/
        sum=sum*10+【?】-'0';
    return sum;
}
int multi(char s[],char t[])
{
    int mul;
/**************************SPACE*************************/
    mul=【?】;
    return mul;
}
int main()
{
    char s1[]="123",s2[]="56";
    int mst;
    mst=multi(s1,s2);
    printf("%d\n",mst);
    return 0;
}