/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------
题目：void fun(long a[],int n)函数对a数组中的n个元素判断其
     是否为升序数，若不是，则调用void rank(long a[],int x)
     函数将数据处理成升序数。

     升序数是指该数的高位数字的值不大于低位数字的值。
     例如123，25689等属于升序数，而1325,39678不属于升序数。

     请改正程序中的错误，使它能得出正确的结果。
---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/

#include <stdio.h>
#define N 5
void rank(long a[],int x)
{
    int i,j,p[10],n;
    long t;
    t=a[x];
    n=0;
    while(t)
    {
        p[n++]=t%10;
        t/=10;
    }
    for(i=0;i<n-1;i++)
/***********FOUND***********/
        for(j=0;j<n-i;j++)
            if(p[j-1]>p[j]) 
            {
                t=p[j-1];p[j-1]=p[j];p[j]=t;
            }
    t=0;
    for(i=0;i<n;i++)
        t=t*10+p[i];
    a[x]=t;
}

void fun(long a[],int n)
{
    int i,f;
    long m;
    for(i=0;i<n;i++)
    {
        m=a[i];f=1;
        do
        {
/***********FOUND***********/
            if(m/10>m%10) f=0;
            m/=10;
        }while(m&&f);
/***********FOUND***********/
        if(f==0) rank(a,n);
    }

}

int main()
{
    int i;
    long a[N]={123,5276,9865,136892,84};
    printf("处理前的数据: ");
    for(i=0;i<N;i++)
        printf("%ld  ",a[i]);
    printf("\n");
    fun(a,N);
    printf("处理后的数据: ");
    for(i=0;i<N;i++)
        printf("%ld  ",a[i]);
    printf("\n");
    return 0;
}