/*-----------------------------------------------------------------------
【程序改错】
-------------------------------------------------------------------------
题目：main函数的dot数组中保存了某地8月份的日最高气温（单位：度）。函数
      double calc(int t[],int c[])找出数组t中第一次和最后一次出现35度
      及以上气温的日期、最高气温、最低气温，并将这些数据保存在数组c中。
      函数返回日平均气温。

程序运行后显示：
8月份第一次出现35度及以上气温的日期是2日
8月份最后一次出现35度及以上气温的日期是28日
8月份最高气温是40度，最低气温是27度
8月份日平均气温是 35.84度

请改正程序中的错误，使它能得出正确的结果。
-------------------------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
------------------------------------------------------------------------*/

#include<stdio.h>

double calc(int t[],int c[])
{
    int i,f_day,l_day,max_t,min_t;
    double avg=0;
    f_day=l_day=0;
    max_t=0;min_t=100;
/***********FOUND***********/
    for(i=0;i<32;++i)
    {
        avg=avg+t[i];
        if(t[i]>=35)
        {
            l_day=i;
            if(f_day==0)f_day=i;
        }
        if(t[i]>max_t)
            max_t=t[i];
        if(t[i]<min_t)
            min_t=t[i];
    }
    c[0]=f_day;
    c[1]=l_day;
    c[2]=max_t;
    c[3]=min_t;
/***********FOUND***********/
    return avg;
}
int main()
{
    int dot[32]={0,28,36,34,35,36,37,36,36,34,38,40,39,
    38,37,36,34,36,37,38,36,34,36,37,38,39,40,40,40,27,29,30};
    int data[4];
    double avg_t;
/***********FOUND***********/
    avg_t=calc(data,dot);
    printf("8月份第一次出现35度及以上气温的日期是%d号\n",data[0]);
    printf("8月份最后一次出现35度及以上气温的日期是%d号\n",data[1]);
    printf("8月份最高气温是%d度,最低气温是%d度\n",data[2],data[3]);
    printf("8月份日平均气温是%6.2f度\n",avg_t);
    return 0;
}
