/*-------------------------------------------------------------------------
【程序设计】
---------------------------------------------------------------------------
题目：老师布置给洋洋的作业是把形如“ 4103  987  19203 ”字符串中连续的数字字
      符子串转换为整数，其中每个连续的数字字符子串中，第一个字符表示其后的数
      字字符串数的进制，例如“4103”表示103是一个4进制数，“987” 表示87是一
      个9进制数，“19203”则表示9203是10进制数。再将这些不同进制的数都转换为
      10进制数。请帮助洋洋编写程序完成以上作业。

处理字符串：“ 4103  987  19203 ”的结果是：
                                            4,103,19
                                            9,87,79
                                            10,9203,9203

编写程序：
1.编写 int change(char s[],int num[][3])函数，将s中字符串转换为2个正整数存
  放在数组num中，其中表示进制的数存放在num的第1列，其后的正整数存放在数组
  num的第2列，函数返回这样的数据个数。

2.编写 void calc(int num[][3],int n)函数，将num中n个不同进制的正整数转换为
  10进制数，存放在num数组的第三列。

---------------------------------------------------------------------------
注意：请勿改动主函数main()中的任何语句。
-------------------------------------------------------------------------*/

#include<stdio.h>
#include<stdlib.h>
#include<ctype.h> 
#define N 10  
int change(char s[],int num[][3])
{
/**********Program**********/




/**********  End  **********/
}
void calc(int num[][3],int n)
{
/**********Program**********/




/**********  End  **********/
}
int main()
{
    char s[]={"  4103  987  19203  "};
    int num[N][3],i,n;
    FILE *fp;
    if((fp=fopen("DATA.TXT","w"))==NULL)
    {
        printf("File open error\n");
        exit(0);
    }
    n=change(s,num);
    calc(num,n);
    for(i=0;i<n;i++)
    {
        printf("%d,%d,%d\n",num[i][0],num[i][1],num[i][2]);
        fprintf(fp,"%d,%d,%d\n",num[i][0],num[i][1],num[i][2]);
    }
    fclose(fp);
    return 0;
}


