/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：下面的程序首先随机产生20个大于或等于900且小于1000的
      素数，然后将这些素数保存在数组array中，并将这些素数
      在屏幕上以每行打印5个的格式输出，请将程序补充完整。

---------------------------------------------------------
注意：请勿改动主函数main()中的其他内容
      且不能使用C语言的库函数。
-------------------------------------------------------*/

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

/*函数isPrime(int m)用于判断整数m是否为素数*/
int isPrime(int m)
{
    int flag=0;
    int i=2,k;
    k=(int)sqrt(m);
/***********SPACE***********/
    while (i<=k && 【?】) i++;
    if(i>k) flag=1;
    return flag;
}

void main()
{
    int array[20];
    int i,t;
    i=0;
    while(i<20)
    {
        t=rand()%100+900;
/***********SPACE***********/
        if (【?】)
        {
            array[i]=t;
            printf("%6d",t);
            i++;
            if (!(i%5)) printf("\n");
        }
    }
    printf("\n"); 
}