/*-----------------------------------------------------------------------
【程序填空】
-------------------------------------------------------------------------
题目：数组x由n个整数构成。函数void splid(int n)将数组中的奇数存放到数组的
      前面部分，偶数存放到数组的后面部分。
      函数void sort(int start, int end, int flag)将x数组中的奇数进行降序
      排列，偶数进行升序排列。

例如：

      数组原始数据为：14  5  10  6  7  4  1  2  9  17
      
          屏幕输出为：17  9  7  5  1  2  4  6  10  14

-------------------------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
-----------------------------------------------------------------------*/
#include<stdio.h>
#define N 10
int x[N]={14,5,10,6,7,4,1,2,9,17}; 
void sort(int start, int end, int flag)
{   
    int i,j,temp;
    for(i=start; i<end-1; i++)  
/**************************SPACE*************************/      
        for(【?】;j<end-1-i+start;j++) 
            if(flag==1?x[j]<x[j+1]:x[j]>x[j+1])
            {        
                temp=x[j]; 
                x[j]=x[j+1];                 
                x[j+1]=temp;
            }
}

void splid(int n)  
{    
    int i=0,j=n-1,temp,k;
    while(i<j)
    {    
        while((i<j)&&(x[i]%2!=0)) i++;
        while((i<j)&&(x[j]%2==0)) j--;
        if(i<j)
        {
            temp=x[i]; 
            x[i]=x[j]; 
            x[j]=temp; 
        } 
    }
    if(i==n-1)
        i=n;
/**************************SPACE*************************/
    【?】;
    sort(0,k,1);
    sort(k,n,0);
}

int main()
{        
    int i;
    splid(N);              
    for(i=0;i<N;i++)
        printf("%5d",x[i]);
    printf("\n");
    return 0;   
}
