/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------
题目：二维数组a中有N*N个无序的整数，将a中的数据存入一维数
      组中，然后在一维数组中将这些数由小到大排序，将排序
      后的数据再存入原来的a数组中。函数sort(int b[])实现
      排序，函数trans(int a[][N],int b[],int f)实现存放数
      据。

例如：初始数据为：
      12  8   -9  0
      -4  20  11  6
      10  2   3   7 
      22  -5  7   9
     结果数据为：
      -9  -5  -4  0
      2   3   6   7
      7   8   9   10
      11  12  20  22
---------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
-------------------------------------------------------*/
#include <stdio.h>
#define N 4
void sort(int b[])
{
    int i,j,k,t;
    for(i=0;i<N*N-1;i++)
    {
        k=i;
        for(j=i+1;j<N*N;j++)
            if(b[j]<b[k])
                k=j;
/**************************SPACE*************************/
        if(【?】)
        {
            t=b[i];b[i]=b[k];b[k]=t;
        }
    }
}
void trans(int a[][N],int b[],int f)
{
    int i,j;
    for(i=0;i<N;i++)
        for(j=0;j<N;j++)
/**************************SPACE*************************/
            f==0?(b[i*N+j]=a[i][j]):(【?】);
}
int main()
{
    int a[N][N]={12,8,-9,0,-4,20,11,6,10,2,3,7,22,-5,7,9},b[N*N];
    int i,j;
    printf("初始数据为：\n");
    for(i=0;i<N;i++)
    {
        for(j=0;j<N;j++)
            printf("%5d",a[i][j]);
        printf("\n");
    }
    trans(a,b,0);
    sort(b);
    trans(a,b,1);
    printf("结果数据为：\n");
    for(i=0;i<N;i++)
    {
        for(j=0;j<N;j++)
            printf("%5d",a[i][j]);
        printf("\n");
    }
    return 0;
}