/*------------------------------------------------------------------------
【程序改错】
--------------------------------------------------------------------------

题目：函数fun的功能是：找出数组中的最大数和次最大数，并把最大数和a[0]中的
      数对调、次最大数和 a[1] 中的数对调,并且不能改变其他数的位置。

      程序运行结果为：      
      调换前数据： 11 5 12 0 3 6 9 7 10 8
      调换后数据： 12 11 5 0 3 6 9 7 10 8
      
--------------------------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
------------------------------------------------------------------------*/
#include <stdio.h>
#define  N 10

int fun(int a[],int n)
{
    int  i, m, t, k;
/***********FOUND***********/
    for(i=0; i<n;i++)
    {    
        m=i;
        for(k=i+1; k<n; k++)
          if(a[k]>a[m])
             m=k;
        t=a[i];
/***********FOUND***********/
        a[m]=a[i];
        a[m]=t;
    }
    return 0;
}

int main()
{ 
    int b[N]={11,5,12,0,3,6,9,7,10,8};
    int i;
    
    printf("\n调换前数据： ");
    for(i=0; i<N; i++) 
        printf("%d ",b[i]);
    printf("\n");
/***********FOUND***********/
    fun(b[0],N);
    
    printf("\n调换后数据： ");
    for(i=0; i<N; i++) 
        printf("%d ", b[i]);
    printf("\n\n");
    return 0;
}