/*------------------------------------------------------------------------
【程序改错】
--------------------------------------------------------------------------

题目：将1-20这20个数字放在a数组中，将其视为一个首尾相连的圆环。要求圆环上
      任意两个相邻的数字之和都是一个素数，比如4+5的和不是素数，把5从数组
      中删除，接下来再判断4+6，依此类推。

例如：数组a中元素为1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20

      程序执行后数组a中元素为1 2 3 4 7 10 13 16

请改正程序中的错误，使它能得出正确的结果。
--------------------------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
-------------------------------------------------------------------------*/
#include<stdio.h>
#define NUM 20
int isprime(int n)
{
    int i;
    for(i=2;i<n;i++)
/*******************FOUND*******************/
        if(n%i==1)
            return 0;
    return 1;
}
void main()
{
    int i,j,a[NUM],n=NUM;
    for(i=1;i<=n;i++)
        a[i-1]=i;
    for(i=0;i<n;i++)
/*******************FOUND*******************/
        if(!isprime(a[i])+!isprime(a[(i+1)%n]))
        {
            if(i+2!=n)
/*******************FOUND*******************/
                for(j=i+1;j<n;j++)
                    a[j-1]=a[j];
            n--;
            i--;
            if(i+1==n)
                i--;
        }
    for(i=0;i<n;i++)
        printf("%4d",a[i]);
    printf("\n");
}
