let school = 
[
    {
        "year": 2019,
        "college":
        [
            {
                "name": "人文学院",
                "major":
                [
                    "汉语言文学（师范）",
                    "小学教育（师范）",
                    "音乐学（师范）",
                    "学前教育（师范）",
                    "秘书学"
                ]
            },
            {
                "name": "外国语学院",
                "major":
                [
                    "英语",
                    "英语（师范）",
                    "日语",
                    "德语"
                ]
            },
            {
                "name": "艺术与纺织服装工程学院",
                "major":
                [
                    "环境设计",
                    "服装与服饰设计",
                    "服装设计与工程",
                    "产品设计",
                    "纺织工程"
                ]
            },
            {
                "name": "生物与食品工程学院",
                "major":
                [
                    "食品质量与安全",
                    "食品质量与安全（高校中外学分互认联合培养项目）",
                    "生物制药",
                    "生物工程",
                    "食品科学与工程"
                ]
            },
            {
                "name": "计算机科学与工程学院",
                "major":
                [
                    "计算机科学与技术（嵌入式培养）",
                    "数字媒体技术（嵌入式培养）",
                    "软件工程（嵌入式培养）",
                    "软件工程（高校中外学分互认联合培养项目）",
                    "物联网工程（嵌入式培养）",
                    "数据科学与大数据技术"
                ]
            },
            {
                "name": "物理与电子工程学院",
                "major":
                [
                    "电子科学与技术",
                    "电子信息工程",
                    "电子信息工程（中外合作办学）",
                    "光电信息科学与工程",
                    "新能源科学与工程"
                ]
            },
            {
                "name": "数学与统计学院",
                "major":
                [
                    "数学与应用数学（师范）",
                    "经济统计学（高校中外学分互认联合培养项目）",
                    "经济统计学",
                    "金融工程",
                    "信息与计算科学(嵌入式培养)"
                ]
            },
            {
                "name": "化学与材料工程学院",
                "major":
                [
                    "材料科学与工程",
                    "材料科学与工程(高校中外学分互认联合培养项目)",
                    "功能材料",
                    "应用化学",
                    "安全工程"
                ]
        },
            {
                "name": "机械工程学院",
                "major":
                [
                    "机械工程",
                    "机械电子工程",
                    "机械电子工程（中外合作办学）"
                ]
            },
            {
                "name": "电气与自动化工程学院",
                "major":
                [
                    "自动化",
                    "测控技术与仪器",
                    "电气工程及其自动化",
                    "电气工程及其自动化（中外合作办学）",
                    "机器人工程（高校中外学分互认联合培养项目）",
                    "机器人工程"
                ]
            },
            {
                "name": "经济与管理学院",
                "major":
                [
                    "公共事业管理",
                    "市场营销",
                    "财务管理",
                    "工程管理",
                    "经济与金融",
                    "经济与金融（高校中外学分互认联合培养项目）",
                    "物流管理"
                ]
            },
            {
                "name": "汽车工程学院",
                "major":
                [
                    "汽车服务工程",
                    "材料成型及控制工程",
                    "车辆工程"
                ]
            },
        ]
    },
    {
        "year": 2020,
        "college":
        [
            {
                "name": "师范学院",
                "major":
                [
                    "汉语言文学（师范）",
                    "小学教育（师范）",
                    "音乐学（师范）",
                    "学前教育（师范）",
                ]
            },
            {
                "name": "外国语学院",
                "major":
                [
                    "英语",
                    "英语（师范）",
                    "日语",
                    "德语"
                ]
            },
            {
                "name": "艺术与纺织服装工程学院",
                "major":
                [
                    "环境设计",
                    "服装与服饰设计",
                    "服装设计与工程",
                    "产品设计",
                    "纺织工程",
                    "视觉传达设计"
                ]
            },
            {
                "name": "生物与食品工程学院",
                "major":
                [
                    "食品质量与安全",
                    "生物制药",
                    "生物工程",
                    "食品科学与工程"
                ]
            },
            {
                "name": "计算机科学与工程学院",
                "major":
                [
                    "计算机科学与技术（嵌入式培养）",
                    "数字媒体技术（嵌入式培养）",
                    "软件工程（嵌入式培养）",
                    "软件工程（高校中外学分互认联合培养项目）",
                    "物联网工程（嵌入式培养）",
                    "数据科学与大数据技术"
                ]
            },
            {
                "name": "物理与电子工程学院",
                "major":
                [
                    "电子科学与技术",
                    "电子信息工程",
                    "电子信息工程（中外合作办学）",
                    "光电信息科学与工程",
                    "新能源科学与工程"
                ]
            },
            {
                "name": "数学与统计学院",
                "major":
                [
                    "数学与应用数学（师范）",
                    "经济统计学",
                    "信息与计算科学(嵌入式培养)"
                ]
            },
            {
                "name": "化学工程学院",
                "major":
                [
                    "材料科学与工程",
                    "功能材料",
                    "应用化学",
                    "安全工程"
                ]
            },
            {
                "name": "机械工程学院",
                "major":
                [
                    "机械工程",
                    "机械电子工程",
                    "机械电子工程（中外合作办学）"
                ]
            },
            {
                "name": "电气与自动化工程学院",
                "major":
                [
                    "自动化",
                    "测控技术与仪器",
                    "电气工程及其自动化",
                    "机器人工程"
                ]
            },
            {
                "name": "商学院",
                "major":
                [
                    "市场营销",
                    "财务管理",
                    "人力资源管理",
                    "工程管理",
                    "经济与金融",
                    "物流管理"
                ]
            },
            {
                "name": "汽车工程学院",
                "major":
                [
                    "汽车服务工程",
                    "材料成型及控制工程",
                    "车辆工程"
                ]
            },
        ]
        },
        {
            "year": 2021,
            "college":
            [
                {
                    "name": "师范学院",
                    "major":
                    [
                        "汉语言文学（师范）",
                        "小学教育（师范）",
                        "学前教育（师范）",
                    ]
                },
                {
                    "name": "外国语学院",
                    "major":
                    [
                        "英语",
                        "英语（师范）",
                        "日语",
                        "德语"
                    ]
                },
                {
                    "name": "纺织服装与设计学院",
                    "major":
                    [
                        "环境设计",
                        "服装与服饰设计",
                        "服装设计与工程",
                        "产品设计",
                        "纺织工程",
                        "视觉传达设计"
                    ]
                },
                {
                    "name": "生物与食品工程学院",
                    "major":
                    [
                        "食品质量与安全",
                        "生物制药",
                        "生物工程",
                        "食品科学与工程"
                    ]
                },
                {
                    "name": "计算机科学与工程学院",
                    "major":
                    [
                        "计算机科学与技术（嵌入式培养）",
                        "数字媒体技术（嵌入式培养）",
                        "软件工程（嵌入式培养）",
                        "软件工程（高校中外学分互认联合培养项目）",
                        "物联网工程（嵌入式培养）",
                        "数据科学与大数据技术"
                    ]
                },
                {
                    "name": "电子信息工程学院",
                    "major":
                    [
                        "电子科学与技术",
                        "电子信息工程",
                        "电子信息工程（中外合作办学）",
                        "光电信息科学与工程",
                        "新能源科学与工程",
                        "电子信息工程（中外合作办学）"
                    ]
                },
                {
                    "name": "数学与统计学院",
                    "major":
                    [
                        "数学与应用数学（师范）",
                        "经济统计学",
                        "信息与计算科学(嵌入式培养)"
                    ]
                },
                {
                    "name": "化学工程学院",
                    "major":
                    [
                        "材料科学与工程",
                        "功能材料",
                        "安全工程",
                        "材料科学与工程(中美学分互认联合培养项目)"
                    ]
                },
                {
                    "name": "机械工程学院",
                    "major":
                    [
                        "机械工程",
                        "机械电子工程",
                        "机械电子工程（中外合作办学）"
                    ]
                },
                {
                    "name": "电气与自动化工程学院",
                    "major":
                    [
                        "自动化",
                        "测控技术与仪器",
                        "电气工程及其自动化",
                        "机器人工程",
                        "电气工程及其自动化(中外合作办学）"
                    ]
                },
                {
                    "name": "商学院",
                    "major":
                    [
                        "市场营销",
                        "财务管理",
                        "人力资源管理",
                        "工程管理",
                        "经济与金融",
                        "物流管理"
                    ]
                },
                {
                    "name": "汽车工程学院",
                    "major":
                    [
                        "汽车服务工程",
                        "材料成型及控制工程",
                        "车辆工程"
                    ]
                },
            ]
        }
    ]
    