/*-------------------------------------------------------------------------
【程序设计】
---------------------------------------------------------------------------
题目：老师布置作业，要求计算某年某月某日是这一年的第几天。小莉把日期写成了
      字符串形式。请帮助小莉编写程序，先将形如“ 2017-03-01 ”的日期字符串
      转换为3个整数，再计算该日期是这一年的第几天。

例如：
字符串为 “ 2017-03-01    2016-03-01      2017-12-31 ”，程序运行结果为
2017-3-1第60天
2016-3-1第61天
2017-12-31第365天
 
编写程序：
1.编写 int change(char d[],int rq[][4])函数，将d中所有日期形式的数字字符子
  串转换为年、月、日3个整数，存放在rq数组的同一行前3列。函数返回形如
  “ 2017-03-01 ”字符子串的个数。

2.编写 void day(int rq[][4],int n)函数，根据rq数组中每行前3个元素表示的年、
  月、日，计算该日期是这一年的第几天，并保存在rq数组同一行的第4列。参数n表
  示rq数组中保存了n行日期数据。

---------------------------------------------------------------------------
注意：请勿改动主函数main()中的任何语句。
-------------------------------------------------------------------------*/

#include<stdio.h>
#include<stdlib.h>
#include<ctype.h>
#define N 10 
int mon[13]={0,31,28,31,30,31,30,31,31,30,31,30,31};
int change(char d[],int rq[][4])
{
/**********Program**********/




/**********  End  **********/
}
void day(int rq[][4],int n)
{
/**********Program**********/




/**********  End  **********/
}
int main()
{
    char date[]={"  2017-03-01    2016-03-01      2017-12-31 "};
    int ymds[N][4];
    int n,i;
    FILE *fp;
    if((fp=fopen("DATA.TXT","w"))==NULL)
    {
        printf("File open error\n");
        exit(0);
    }
    n=change(date,ymds);
    day(ymds,n);
    for(i=0;i<n;i++)
    {
        printf("%d-%d-%d第%d天\n",ymds[i][0],ymds[i][1],ymds[i][2],ymds[i][3]);
        fprintf(fp,"%d-%d-%d第%d天\n",ymds[i][0],ymds[i][1],ymds[i][2],ymds[i][3]);
    }
    fclose(fp);
    return 0;
}