/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：将字符串sour中连续的数字字符和其前面的符号转换为若
      干个十进制整数(可正，可负)，再计算这些整数的和。

例如：字符串"kn--.23,q,-37.&#%%-18'w94jAF5aS"，转换为整
      数求和即23-37-18+94+5,结果为67

---------------------------------------------------------
注意：请勿改动程序中的其他内容。
-------------------------------------------------------*/

#include <stdio.h>
#include <ctype.h>
void apart(char a[])
{  
    int i,sum,sign=1,s;
    i=sum=0;
    while(a[i])
    {
        while(!isdigit(a[i]) && a[i])
        {
/**************************SPACE*************************/
            sign=【?】?-1:1;
            i++;
        }
        s=0;
        while(isdigit(a[i]))
/**************************SPACE*************************/
            s=s*10+【?】;
        s=s*sign;
        if(s!=0)
            sum+=s;
    }
    printf("%d\n",sum);
}
int main()
{
    char sour[100]={"kn--.23,q,-37.&#%%-18'w94jAF5aS"};
    apart(sour);
    return 0;
}