/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：主函数main()中调用fun()函数，其中fun函数的功能是：
      将字符串s正序和逆序进行连接，形成新的字符串t。例如，
      当字符串s为”ABCD”时，形成的新串t为”ABCDDCBA”。

下面给定的程序存在错误，请改正。

---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/

#include<stdio.h>
#include<string.h>
/***********FOUND***********/
void fun(char s,char t)
{
    int i,d;
    d=strlen(s);
    for(i=0;i<d;i++) t[i]=s[i];
    for(i=0;i<d;i++) t[d+i]=s[d-1-i];
/***********FOUND***********/
    t[2*d-1]='\0';
}

int main()
{
    char s[100],t[100];
    printf("Please enter string s:");
/***********FOUND***********/
    scanf("%s",&s);
    fun(s,t);
    printf("The result is:%s\n",t);
    return 0;
}
