/*------------------------------------------------------------------------
【程序设计】
--------------------------------------------------------------------------
题目：主函数main()中二维字符数组s为测试数据，字符数组s中存放了N个十六进制
      的字符串"7E2"，"4DB3"，"3039"，"3931"，"533"，"A14"，将这些十六进制
      字符串转换成其对应的十进制整数存放到一维数组a中，并把a数组中的回文
      数提取放入b数组，函数返回b数组中回文数的个数。(字符串中字母均为大写)

回文数是指：这个数的逆序数与这个数的本身相等。

编写程序：
      1.编写函数void abstract(char s[][10],int a[])，将二维字符数组s中N个
        十六进制形式的字符串转换成十进制整数存入数组a中。

      2.编写函数int find(int a[],int b[])，将a数组中的回文数放入b数组中，
        函数返回b数组中回文数的个数。

运行结果：              
                        7E2         2018
                        4DB3        19891
                        3039        12345
                        3931        14641
                        533         1331
                        A14         2580
                        回文数有：19891  14641  1331
-------------------------------------------------------------------------
注意：请勿改动主程序main()中的任何语句。
-------------------------------------------------------------------------*/
#include<stdio.h>
#include<string.h>
#include<ctype.h>
#include<stdlib.h>
#define N 6
void abstract(char s[][10],int a[])
{
/**********Program**********/




/**********  End  **********/
}
int find(int a[],int b[])
{
/**********Program**********/




/**********  End  **********/
}
int main()
{ 
    int a[N],b[N];
    char s[N][10]={"7E2","4DB3","3039","3931","533","A14"};
    int i,num;
    FILE *fp;
    if((fp=fopen("DATA.dat","w"))==NULL)
    {
        printf("File open error\n");
        exit(0);
    }
    abstract(s,a);
    for(i=0;i<N;i++)
    {
        printf("%s\t",s[i]);
        fprintf(fp,"%s\t",s[i]);
        printf("%d\t",a[i]);
        fprintf(fp,"%d\t",a[i]);
        printf("\n");
    }
    num=find(a,b);
    printf("回文数有：");
    fprintf(fp,"回文数有：");
    for(i=0;i<num;i++)
    {
        printf("%d\t",b[i]);
        fprintf(fp,"%d\t",b[i]);
    }
    fclose(fp);
    return 0;
}


