/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------
题目：从小到大顺序找出所有的水仙花数，依次存入二维数组ar
      的第一列，并把每个水仙花数对应的逆序数存入同一行的
      第二列，再找到水仙花数与其逆序数之和最小的行，该行
      之前数据保持不变，该行到最后一行数据，以行为单位循
      环前移一行，该行移至最后一行。

      “水仙花数”是指一个三位数，各位数字的立方之和等于
      该三位数自身。例如153=1^3+5^3+3^3，因此153就是水仙
      花数。

例如：按规则得到的二维数组:
        153    351
        370    73
        371    173
        407    704
      移动后的二维数组:
        153    351
        371    173
        407    704
        370    73

编写程序：
      1.编写函数int sxh(int ar[][2])实现以下功能：按从小
      到大顺序将所有水仙花数存入ar数组的第一列，并把该水
      仙花数对应的逆序数存入同一行的第二列，函数返回水仙
      花数的总个数。

      2.编写函数void mov(int ar[][2],int n)，在ar数组的n
      行中找到水仙花数与其逆序数之和最小的行，该行之前数据
      保持不变，该行到最后一行数据，以行为单位循环前移一行，
      该行移至最后一行。

---------------------------------------------------------
注意：请勿改动主程序main()中的任何语句。
---------------------------------------------------------*/

#include<stdio.h>
#include<stdlib.h>
#include<conio.h>
#include<math.h>
#define N 10
#define M 2
int sxh(int ar[][M])
{
/**********Program**********/




/**********  End  **********/
}
void mov(int ar[][M],int n)
{
/**********Program**********/




/**********  End  **********/
}
int main()
{ 
    int a[N][M]={0};
    int num;
    int i,j;
    FILE *fp;
    if((fp=fopen("DATA.TXT","w"))==NULL)
    {
        printf("File open error\n");
        exit(0);
    }
    num=sxh(a);
    printf("二维数组\n");
    for(i=0;i<num;i++)
    {
        for(j=0;j<M;j++)
        {
            printf("%d\t",a[i][j]);
            fprintf(fp,"%d\t",a[i][j]);
        }
        putchar('\n');
        fputc('\n',fp);
    }
    mov(a,num);
    printf("移动后\n");
    fprintf(fp,"移动后\n");
    for(i=0;i<num;i++)
    {
        for(j=0;j<M;j++)
        {
            printf("%d\t",a[i][j]);
            fprintf(fp,"%d\t",a[i][j]);
        }
        putchar('\n');
        fputc('\n',fp);
    }
    fclose(fp);
    getch();
    return 0;
}