/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

    函数void change(char s[],char t[])将s字符串中字母和数
    字字符按以下规则转换，并将其保存在t中。其他字符则不作
    转换。

    大写字母转换规则：'A'->'z','B'->'y',...,'Z'->'a'
    小写字母转换规则：'z'->'A','y'->'B',...,'a'->'Z'
    数字字符转换规则：'0'->'9','1'->'8',...,'9'->'0'

---------------------------------------------------------
注意：请勿改动程序中的其他内容。
-------------------------------------------------------*/
#include<stdio.h>
#include<ctype.h>
void change(char s[],char t[])
{
    int i;
    for(i=0;s[i];++i)
    {
        if(isalpha(s[i]))
            t[i]=(isupper(s[i]) ? 'Z'-s[i]+'a' : 'z'-s[i]+'A');
        else if(isdigit(s[i]))
            t[i]='9'-s[i]+'0';
        else
/**************************SPACE*************************/
            【?】;
    }
    t[i]=0;
}
int main()
{
    char t[100]="7984 RH hSVVK BVZI,dRHS BLF TLLW OFXP!";
    char s[100];
/**************************SPACE*************************/
    【?】;
    printf("%s\n",s);
    return 0;
}