/*------------------------------------------------------------------------
【程序改错】
--------------------------------------------------------------------------
题目：下列程序的功能是：统计并输出子串substr在原数组str中每个字符串中出现
      的次数，并输出该子串每次出现在每个字符串中的起始位置序号
      （序号从1开始）。

例如：若str数组中的数据为:{"This is a book.","This is a disk."}
      输入子串："is"

运行结果为：
            第1个字符串中出现子串的次数为：2    位置序号为：3   6    
            第2个字符串中出现子串的次数为：3    位置序号为：3   6   12       

请改正程序中的错误，使它能得出正确的结果。
--------------------------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
-------------------------------------------------------------------------*/
#include<stdio.h>
#include<conio.h>
#define N 20

void count_str(char str[][N], char substr[], int pos[][N])
{
    int i,j,k,m,n;
    for(m=0;m<2;m++)
    {
        n=0;
        for(i=0;str[m][i]!='\0';i++)
        { 
            j=i;
            k=0;
            while(substr[k]==str[m][j]&&substr[k])
            {  
                k++;
                j++;
            }
        /***********FOUND***********/
            if(substr[k]='0')
                pos[m][n++]=i+1; 
        }
        printf("第%d个字符串中出现子串的次数为：%d\t位置序号为：",m+1,n);
        for(j=1;j<=n;j++)
        /***********FOUND***********/                
            printf("%4d",pos[m][j]);
        printf("\n");
    }
}
int main()
{  
    int pos[2][N];
    char str[2][N]={"This is a book.","This is a disk."},substr[N]="is";
    /***********FOUND***********/
    count_str(substr[N],str[2][N],pos[2][5]);
    return 0;
}
