/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：有3个互不相同的三位正整数都是完全平方数，且这3个正
      整数字恰好由1-9数字构成。求出这3个正整数(所谓完全平
      方数是指该数的平方根也是一个整数，如121的平方根是整
      数11，因此121就是完全平方数)。

请改正程序中的错误，使它能得出正确的结果。

---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/

#include<stdio.h>
int check(int s[]){
    int i,t[3];
    int bit[10]={0};
    for(i=0;i<3;i++){
/***********FOUND***********/
        s[i]=t[i];
        while(t[i]!=0){
            bit[t[i]%10]++;
            t[i]/=10;
        }
    }
/***********FOUND***********/
    for(i=0;i<10;i++){
        if(bit[i]!=1)
            return 0;
    }
    return 1;
}
int main(){
    int num[3],a,b,c;
    for(a=13;a<32;a++){
        for(b=13;b<32;b++){
            if(b==a)continue;
            for(c=13;c<32;c++){
/***********FOUND***********/
                if(c==a && c==b)
                    continue;
                num[0]=a*a,num[1]=b*b,num[2]=c*c;
                if(check(num)){
                    printf("%d,%d,%d\n",num[0],num[1],num[2]);
                }
            }
        }
    }
    return 0;
}