/*----------------------------------------------------------------------
【程序填空】
------------------------------------------------------------------------
题目：小明编写了int ch(int f,int x,int t)函数，可以将f进制数的正整数x转
      换成t进制的正整数。但是f和t两个参数中，必须有一个是10。小明发现只
      要连续调用ch函数2次，利用10进制过渡，就可以实现两个任意进制
      （进制<=10）的正整数的相互转换。

程序运行结果如下:
        6进制的 125 = 9进制的  58
        9进制的  58 = 6进制的 125

-----------------------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他部分。
---------------------------------------------------------------------*/
#include<stdio.h>
int ch(int f,int x,int t)
{
    int m,p;
    m=0;
    p=1;
    while(x)
    {
        m=m+x%t*p;
        x/=t;
        p*=f;
    }
/**************************SPACE*************************/
    【?】;
}
int chft(int f,int x,int t)
{
/**************************SPACE*************************/
    return ch(10,ch(【?】),t);
}

int  main()
{ 
    printf("6进制的125 = 9进制的%4d\n",chft(6,125,9));
    printf("9进制的 58 = 6进制的%4d\n",chft(9,58,6));
    return 0;

}
