/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：int sort(int a[],int n)函数将n个元素的数组a中互不相
      同的元素按升序排列，重新存入数组a中，函数返回按升序
      排列后互不相同元素的个数。

例如：数组a中元素为6,2,7,5,4,3,4,6,5,4，调用sort函数后，
      函数值为6，主函数中输出排序后的数组a元素为
      2，3，4，5，6，7。

      请改正程序中的错误，使它能得出正确的结果。

---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/

#include <stdio.h>
int sort(int a[],int n)
{
    int i,j,k,low,high,mid,t;
    for(k=i=1;i<n;i++) 
    {
        low=0;
        high=k-1;
        while(low<=high)
        {
            mid=(low+high)/2;
            if(a[mid]>=a[i]) high=mid-1;
            else  low=mid+1;
        }
        if(low>=k||a[low]!=a[i])
        { 
/*******************FOUND*******************/
            t=a[i]-1;
/*******************FOUND*******************/ 
            for(j=k;j>=low;j--)
                a[j+1]=a[j];
            a[low]=t;
            k++;
        }
    }
    return k;  
}
int main()
{
    int a[ ]={6,2,7,5,4,3,4,6,5,4};
    int i,n;
    n=sizeof(a)/sizeof(int);
    for(i=0;i<n;i++)
        printf("%d\t",a[i]);
/*******************FOUND*******************/
    sort(a,n);                    
    printf("\nAfter sorting:\n");
    for(i=0;i<n;i++)
    printf("%d\t",a[i]);
    printf("\n");
    return 0;
}