/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

    函数void check(long n, int c[])检测长整型正整数n是几
    位数，同时找出最小的数字。将位数和最小的数字存放在数
    组c中。
    例如n=1256044时，n是7位数，最小的数字是0。

---------------------------------------------------------
注意：请勿改动程序中的其他内容。
-------------------------------------------------------*/

#include <stdio.h>
/**************************SPACE*************************/
void  check(long  n, int 【?】)
{
    int min,p,k;
    min=9;
    p=0;
    do{
        k=n%10;
        min=(min>k)? k: min;
        n/=10;
        p++;
    }while(n);
    c[0]=p;
    c[1]=min;
}
int main()
{
    long n;
    int c[2];
    printf("输入长整型正整数：");
    scanf("%ld",&n);
    check(n, c);
/**************************SPACE*************************/
    printf("%ld是%d位数,最小数字是%d\n",【?】);
    return 0;
}