/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：主函数main()调用fun()函数，其中fun函数的功能是：找
      出100到999之间（含100和999）所有整数中各位上数字之
      和为x（x为正整数）的整数并输出，符合条件的整数个数
      作为函数值返回。
      例如，当x值为5时，满足条件的整数有：
      104、113、122、131、140、203、212、221、230、302、
      311、320、401、410、500，一共15个。

下面给定的程序存在错误，请改正。

---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/

#include<stdio.h>
/***********FOUND***********/
void fun(int x)
{
    int n,s1,s2,s3,t;
    n=0;
    t=100;
    while(t<=999)
    {
/***********FOUND***********/
        s1=t%10; s2=t%10%10; s3=t/100;
        if(s1+s2+s3==x)
        {
            printf("%5d",t);
            n++;
        }
        t++;
    }
    return n;
}

int main()
{
    int x=-1;
    while(x<=0)
    {
        printf("Please input x(x>0):");
/***********FOUND***********/
        scanf("%d",x);
    }
    printf("\nThe result is: %d\n",fun(x));
    return 0;
}
