/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：sort()函数将from数组中的元素逐个放入to数组中，使得
      to数组中的元素按升序排列。

请改正程序中的错误，使它能得出正确的结果。

---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/

#include <stdio.h>
#define N 10
void sort(int from[],int to[]){
    int i,j,k;
/***********FOUND***********/
    for(i=0;i<N-1;i++){
        k=0;
        for(j=0;j<N;j++)
            if(from[i]>from[j] || from[i]==from[j] && i>j)
                k++;
/***********FOUND***********/
        to[i]=from[k];
    }
}
int main(){
    int a[N]={12,5,-3,20,6,0,9,5,12,-7},b[N];
    int i;
    for(i=0;i<N;i++)
        printf("%d\t",a[i]);
/***********FOUND***********/
    sort(b[N],a[N]);
    for(i=0;i<N;i++)
        printf("%d\t",b[i]);
    return 0;
}