/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：计算x数组中N个数的平均值（规定所有数均为正数），将
      数组中小于平均值的数据顺序移动到数组的前部，大于等
      于平均值的数据顺序移到x数组的后部。例如，
      有10个正数：47、30、32、40、6、17、45、15、48、26，
      其平均值为30.5，移动后的输出为：30、6、17、15、26、
      47、32、40、45、48。

---------------------------------------------------------
注意：请勿改动主函数main()中的其他内容。
-------------------------------------------------------*/

#include<stdio.h>
#include<stdlib.h>
#define N 10
void main()
{   
    double fun(double x[]);
    int i; double x[N];
    for(i=0;i<N;i++)
    {   
        x[i]=rand()%50;
        printf("%4.0f",x[i]); 
    }
    printf("\n");
    printf("The average is:%f\n",fun(x));
    for(i=0;i<N;i++)
        printf("%5.0f",x[i]);
    printf("\n");
}
double fun(double x[])
{
    int i,j;
    double aver=0,y[N];
    for(i=0;i<N;i++)
        aver+=x[i];
    aver=aver/N;
    for(i=j=0;i<N;i++)
        if(x[i]<aver)
        { 
/**************************SPACE*************************/
            y[j]=x[i];x[i]=-1;【?】
        }
        i=0;
        while(i<N)
/**************************SPACE*************************/
        {   if(x[i]!=-1) 【?】
            i++;                    
        }
        for(i=0;i<N;i++) x[i]=y[i];
        return aver;
}