/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：将从键盘输入的N个整数储存在一个数组中,然后将数组中
      的数按从小到大的顺序进行排列。

---------------------------------------------------------
注意：除要求填空的位置之外,请勿改动程序中的其他内容。
      且不能使用C语言的库函数进行填空。
-------------------------------------------------------*/

#include "stdio.h"
#define N 5

/*以插入排序的方法将数组a[]中的数据排序，当参数order为0时，
 将数据从小到大排列；当参数order为1时，将数据从大到小排列。*/
void insert_sort(int a[],int n,int order)
{
    int i,j,t;
    for(i=1;i<n;++i)
    {
/***************SPACE***************/        
        if(【?】&& order==0)
        {
            t=a[i];
            j=0;
            for(j=i-1;j>=0 && t<a[j];--j)
                a[j+1]=a[j];
            a[j+1]=t;
        }

        if(a[i]>a[i-1] && order==1)
        {
            t=a[i];
            j=0;
            for(j=i-1;j>=0 && t<a[j];--j)
                a[j+1]=a[j];
            a[j+1]=t;
        }

    }
}

void main( ){
    int i,num[N];
    for( i=0;i<N;i++ )
    {
        printf("Enter the No. %3d Integer:\n",i);
        scanf("%d",&num[i]);
    }
/***************SPACE***************/
    insert_sort(【?】);

    printf("\n\n");
    for( i=0;i<N;i++)
        printf("%5d",num[i]);
    printf("\n\n");

}