/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：数组cj[10]中有10名学生的c语言考试成绩,函数fun()的功
      能是依据成绩将其各自的名次保存到数组mc中。

例如：成绩：    92  78  60  99  81  92  85  84  76  88
      对应名次： 2   8  10   1   7   2   5   6   9   4 

---------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
      且不能使用C语言的库函数
-------------------------------------------------------*/

#include<stdio.h>
void fun(int cj[],int  mc[],int n)
{
    int  i,j;
    for(i=0;i<n;i++)
    {
/***********SPACE***********/
        【?】;
/***********SPACE***********/
        for(j=0;【?】;j++)
            if(cj[i]<cj[j])
                mc[i]++;
    }
}
void main()
{
    int  cj[10]={92,78,60,99,81,92,85,84,76,88},mc[10],i;
    fun(cj,mc,10);
    printf(" 成绩:");
    for(i=0;i<10;i++)
        printf(" %3d ",cj[i]);
    printf("\n");
    printf(" 名次:");
    for(i=0;i<10;i++)
        printf(" %3d ",mc[i]);
    printf("\n");
}