/*------------------------------------------------------------------------
【程序改错】
--------------------------------------------------------------------------
题目：函数int rotate(int n,int m)将正整数n的各位向右循环移动m位，形成一个
      新的正整数返回。函数rotate存在3个错误，请改正，使它能得出正确的结果。

测试数据
        3049 182 50174 66271 18
程序运行后结果为
        4930 821 74501 71662 18

---------------------------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------------------------*/
#include <stdio.h>
#include <math.h>
#define N 5
int rotate(int n,int m)
{
    int i,p,newv;
    p=(int)pow(10,m);
/***********FOUND***********/
    newv=n/p;
    i=n/=p;
    p=0;
    while(i)
    {
/***********FOUND***********/
        i/=m;
        p++;
    }
    newv=newv*(int)pow(10,p)+n;
/***********FOUND***********/
    return n;
}
int main()
{
    int n[2][N]={3049,182,50174,66271,18};
    int i;
    for(i=0;i<N;i++)
        printf("%d\t",n[0][i]);
    printf("\n");
    for(i=0;i<N;i++)
        n[1][i]=rotate(n[0][i],2);
    for(i=0;i<N;i++)
        printf("%d\t",n[1][i]);
    printf("\n");
    return 0;
}
