/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：建立一个N*N的矩阵，矩阵元素的构成规律是：最外层元素
      的值全部为1；从外向内第2层元素的值全部为2；第3层元
      素的值全部为3，……依此类推。例如，若N=5，则生成的
      矩阵为：
      1   1   1   1   1
      1   2   2   2   1
      1   2   3   2   1
      1   2   2   2   1
      1   1   1   1   1

---------------------------------------------------------
注意：请勿改动主函数main()中的其他内容。
-------------------------------------------------------*/

#include<stdio.h>
#define N 7
void main()
{
    void fun(int x[][N],int n);
    int x[N][N]={0},i,j;
    fun(x,N);
    printf("The result is:\n");
    for(i=0;i<N;i++)
    {        
        for(j=0;j<N;j++)
            printf("%4d",x[i][j]);
        printf("\n");           
    }
}
void fun(int x[][N],int n)
{
    int i,j,k,m;
    if(n%2==0) m=n/2;
    else m=n/2+1;
    for(i=0;i<m;i++)
    {
/**************************SPACE*************************/
        for(【?】;j<n-i;j++)
            x[i][j]=x[n-i-1][j]=i+1;
        for(k=i+1;k<n-i;k++)
/**************************SPACE*************************/
            x[k][i]=x[k][n-i-1]=【?】;
    }
}
