/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：一维整型数组a的元素具有如下特点：元素的所有奇数按升
      序排列，而偶数则无序。
      insert()函数按照如下规则插入一个整型元素：如插入的
      是偶数，则插在数组第一个元素的位置，如插入的是奇数，
      则插入后使数组中的奇数仍然是升序排列。

例如：数组中元素为
          3,12,9,4,13,6,21
     则插入偶数8后，数组中元素为
          8,3,12,9,4,13,6,21
     再插入奇数11后，数组中元素为
          8,3,12,9,4,11,13,6,21

请改正程序中的错误，使它能得出正确的结果。

---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/

#include <stdio.h>
#define N 100
void insert(int a[],int x,int n){
    int i,j;
    if(x%2==0){
/***********FOUND***********/
        for(i=n;i>=0;i--)
            a[i]=a[i-1];
        a[0]=x;
    }
    else{
        for(i=0;i<n;i++)
/***********FOUND***********/
            if(a[i]%2!=0 || x<a[i])
                break;
        for(j=n;j>i;j--)
            a[j]=a[j-1];
/***********FOUND***********/
        a[j+1]=x;
    }
}
int main(){
    int a[N]={3,12,9,4,13,6,21};
    int i,len;
    len=7;
    for(i=0;i<len;i++)
        printf("%d ",a[i]);
    printf("\n");
    insert(a,8,len);
    len++;
    for(i=0;i<len;i++)
        printf("%d ",a[i]);
    printf("\n");
    insert(a,11,len);
    len++;
    for(i=0;i<len;i++)
        printf("%d ",a[i]);
    printf("\n");
    return 0;
}