/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：1、第一个for循环中给a数组10个元素依次赋字符
         'A'、'B'、'C'、'D'、'E'、'V'、'W'、'X'、'Y'、'Z'。

      2、第二个for循环中使a数组10个元素的值对称折叠，变成
        'A'、'B'、'C'、'D'、'E'、'E'、'D'、'C'、'B'、'A'。

      3、第三个for循环输出的字符依次是
         'A'、'B'、'C'、'D'、'E'、'A'、'B'、'C'、'D'、'E'。

---------------------------------------------------------
注意：请勿改动主函数main()中的其他内容。
-------------------------------------------------------*/

#include <stdio.h>
void main(){
        int a[10];
        int i;
        for(i=0;i<10;i++)
           if(i<5) a[i]=i+65;
/***********SPACE***********/
           else    a[i]=【?】;
        for(i=0; i<5; i++)
                a[9-i]=a[i];
        for(i=0;i<10;i++)
/***********SPACE***********/
                printf("%c\t",a[i<5 【?】]);
        printf("\n");
}