/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：reverse()函数将一维数组a中元素逆序。

请改正程序中的错误，使它能得出正确的结果。

---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/

#include<stdio.h>
#define N 10
/***********FOUND***********/
void reverse(int a,int n){
    int i;
/***********FOUND***********/
    for(i=0;i<n;i++){
        a[n-1-i]=a[n-1-i]+a[i];
/***********FOUND***********/
        a[i]=a[i]-a[n-1-i];
        a[n-1-i]=a[n-1-i]-a[i];
    }
    return ;
}
int main(){
    int i;
    int a[N]={23,0,-4,8,9,13,6,-21,17,5}; 
    for(i=0;i<N;i++)
        printf("%d\t",a[i]);
    printf("\n");
    reverse(a,N);
    for(i=0;i<N;i++)
        printf("%d\t",a[i]);
    printf("\n");
    return 0;
}