/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：填充的规则是:使用1,2,3，……的自然数列，从左上角开始，
      按照顺时针方向螺旋填充。
例如：当n=5时，输出：
      1  2  3  4  5
      12 13 14 6
      11 15 7
      10 8
      9

---------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
      且不能使用C语言的库函数
-------------------------------------------------------*/

#include<stdio.h>
#define N  10
void  fun(int a[N][N],int row)
{
    int i,j,m=0,n,k=1;
/***********SPACE***********/ 
     【?】;
    for(i=1;i<=row;i++)
        for(j=1;j<=row-i+1;j++)
            if(i%3==1)
                a[m][++n]=k++;
/***********SPACE***********/ 
            else if(【?】)
                a[++m][--n]=k++;
            else
                a[--m][n]=k++;
}

void  main()
{
    int a[N][N]={0},i,j,row;
    printf("please  input  row:");
    scanf("%d",&row);
    fun(a,row);
    for(i=0;i<row;i++)
    {
        for(j=0;j<row-i;j++)
            printf("%4d",a[i][j]);
        printf("\n");
    }
}
