/*--------------------------------------------------------------------------
【程序填空】
----------------------------------------------------------------------------
题目：函数int trans(char p[])的功能是：统计字符串p中保存的英文单词个数（单词
      间用空格隔开），并将每个单词的首字母转换为大写字母。函数返回单词个数。

例如：初始字符串为：I am trying to rEAD

输出结果为：  初始字符串有：       5个单词
              处理后的字符串是：   I Am Trying To READ
----------------------------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
---------------------------------------------------------------------------*/

#include<stdio.h>
#include<string.h>
#include<ctype.h>
int trans(char p[])
{         
    int i,len=strlen(p),n=0;
    for(i=0;p[i];i++)
    {
/**************************SPACE*************************/
        while(p[i]== 【?】)
            i++;
        if(i<len) 
            n++;
        if(p[i]>='a'&&p[i]<='z')
/**************************SPACE*************************/
            p[i]= 【?】;
        while (isalpha(p[i]))
            i++;
    }
    return n;
}

void main()
{          
    int n;
    char str[80]=" I am trying to rEAD";
    printf("初始字符串为：%s \n",str);
    n=trans(str);
    printf("初始字符串有： %5d 个单词\n",n);
    printf("处理后的字符串为：%s \n",str);
}