/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：找出[1,999]之间的符合以下条件的数，该数的各位数字阶
      乘之和正好等于它本身。

例如：145＝1!+4!+5!

---------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
      且不能使用C语言的库函数
-------------------------------------------------------*/

#include<stdio.h>
#define N  10
int  fun(int jc[],int b[])
{  
    int i,x,n=0,sum;
    for(i=1;i<1000;i++)
    {   
        sum = 0;
        x = i;
        while(x)
        {
/***********SPACE***********/
            sum+= 【?】 ;
            x/=10;
        }
/***********SPACE***********/
        if( 【?】)
            b[n++]=sum;
    }
    return n;
}
void  main()
{  
    int jc[]={1,1,2,6,24,120,720,5040,40320,362880};
    int i,x,j,t,n,b[N];
    n=fun(jc,b);
    for(i=0;i<n;i++)
    {
        printf("%d=",b[i]);
        x=b[i];
        j=100;
        while(j)
        {
            t=(x-x%j)/j;
            if(t)
            { 
                printf("%d!+",t);
                x=x%j;
            }
            j/=10;
        }
        printf("\b \b\n");
    } 
}
