/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：fun()函数的功能是：对a数组（共有N个元素）中第n到第m，
　　　共（m-n+1）个数进行升序排序，其中n>=1、m<=N、m>=n。


例如：当n=3,m=8时
      排序前 95,85,75,65,55,45,35,25,15,5
      排序后 95,85,25,35,45,55,65,75,15,5
---------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
      且不能使用C语言的库函数
-------------------------------------------------------*/

#include<stdio.h>
#define N 10
void fun(int a[N],int n,int m)
{ 
    int i,j,x;
    i=m-2;
/***********SPACE***********/
    while(【?】)
    { 
        x=a[i];
        j=i+1;
/***********SPACE***********/
        while( j<=m-1 && 【?】)
        { 
            a[j-1]=a[j]; 
            j=j+1;
        }
        a[j-1]=x;
        i--;
    }
}
void main()
{        
    int a[N]={95,85,75,65,55,45,35,25,15,5};
    int i,n=3,m=8;
    for(i=0;i<N;i++)
        printf("%4d",a[i]);
    printf("\n");
    fun(a,n,m);
    for(i=0;i<N;i++)
        printf("%4d",a[i]);
    printf("\n");
}
