/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：主函数main()调用函数change()将二维数组strrow中的字符
      按列存入一维数组strcol中。

下面给定的程序存在错误，请改正。

---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/

#include <stdio.h>
#include <conio.h>
/***********FOUND***********/
void change(char t[5][],char s[]){
    int i,j;
    for(j=0;j<5;j++)
        for(i=0;i<3;i++)
/***********FOUND***********/
            s[3*j+i]=t[j][i];
/***********FOUND***********/
    s[j]=0;
}

int main(){
    char strrow[][5]={{'C','r','r',' ','s'},{' ','o','a','T','t'},{'P','g','m','e','!'}};
    char strcol[16];
    change(strrow,strcol);
    puts(strcol);
    getch();
    return 0;
}