/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

    主函数main()中二维数组int num[6][3]为测试数据，num数
    组各行第一、二列已经赋值为
    {{4,12},{0,11},{6,-3},{12,7},{5,1},{13,9}}。
    程序计算num数组各行第三列数据，并根据第三列数的大小
    对num数组进行升序排序。
    num数组各行第三列数等于下列a、b两个整数之和：
    a=该行第一列数+最小非负整数，使得a为3的倍数，
    例如，num数组第一行第一列数为4，则最小非负整数为2；
          第二行第一列数为0，则最小非负整数为0；
          第五行第一列数为5，则最小非负整数为1；
    b=该行第二列数*该数所在行、列下标之和。

    编写函数：
    1)编写函数void cal(int num[][3],int n)，根据上述计算
      方法，计算num数组各行第三列数。
    2)编写函数void sort(int num[][3],int n)，根据num数组
      第三列数据的大小，对num数组进行升序排序。

---------------------------------------------------------
注意：请勿改动主函数main()中的任何语句。
---------------------------------------------------------*/

#include<stdio.h>
#include<stdlib.h>
#include<conio.h>
void cal(int num[][3],int n)
{
/**********Program**********/



    
/**********  End  **********/
}
void sort(int num[][3],int n)
{
/**********Program**********/



    
/**********  End  **********/
}
int main()
{
    int num[6][3]={{4,12},{0,11},{6,-3},{12,7},{5,1},{13,9}};
    int i;
    FILE *fp;

    if((fp=fopen("DATA.TXT","w"))==NULL)
    {
        printf("File open error\n");
        exit(0);
    }
    cal(num,6);
    sort(num,6);

    for(i=0;i<6;i++){
        printf("%5d%5d%5d\n",num[i][0],num[i][1],num[i][2]);
        fprintf(fp,"%5d%5d%5d\n",num[i][0],num[i][1],num[i][2]);
    }
    fclose(fp);
    return 0;
}