/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：找出二维数组 a中的"鞍点"数，并在main()函数中输出该
      鞍点的下标。所谓"鞍点"就是该数在所在行中最大，所在
      列中最小。
例如：a[4][5]:  32  45  12  75  72
                22  19  25  61  11
                98  36  21  80  21
                84  41  37  78  29
      "鞍点"数的下标为（1，3），值是61。

---------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他内容。
      且不能使用C语言的库函数
-------------------------------------------------------*/

#include<stdio.h>
#define  M  4
#define  N  5
int  find(int a[][N],int b[])
{
    int i,j,k,row,col;
    for(i=0;i<M;i++)
    {
        col=0;
        for(j=1;j<N;j++)
            if(a[i][col]<a[i][j])
/***********SPACE***********/
                【?】;
        row=i;
        for(k=0;k<M;k++)
            if(a[row][col]>a[k][col])
                row=k;
/***********SPACE***********/
        if( 【?】 )
        { 
            b[0]=row;
            b[1]=col;
            return 1;
        }
    }
    return 0;
}
void  main()
{
    int a[M][N]={32,45,12,75,72,22,19,25,61,11,98,36,21,80,21,84,41,37,78,29};
    int i,j,b[2],f;
    for(i=0;i<M;i++)
    {
        for(j=0;j<N;j++)
            printf("%6d",a[i][j]);
        printf("\n");
    }
    f=find(a,b);
    if(f)
        printf("\n　该数组的鞍点下标：(%d,%d)，值为：%d\n",b[0],b[1],a[b[0]][b[1]]);
    else
        printf("\n　该数组中没有鞍点！\n");
}
