#include <stdio.h>
int main(void)
{
    int a[5]={1,2,3,4,5}; //定义一个普通整形数组
    int b[5][5]={{11,12,13,14,15},{21,22,23,24,25},{31,32,33,34,35},{41,42,43,44,45},{51,52,53,54,55}};//定义一个二维数组
    int(*p)[5]=&a; //定义一个数组指针指向拥有5个整形元素的数组
    int i,j;
    for (i = 0; i < 5;i++)
    {
        printf("a[%d] = %d \n", i, a[i]);
    }
    //通过数组指针打印
    for (i = 0; i < 5;i++)
    {
        printf("*(*p+%d) = %d \n", i, *(*p + i));
        //p指向的是数据a的地址 通过*p取出a的地址*p = a **p = a[0] *(*p+i) = a[i]
    }
    p = b; // p 是一个指向有5个元素的数组，b是二维数组名，代表的就是b[0] ，也就是b数组第一行的地址；
    //通过数组指针访问b
    for (i = 0; i < 5;i++)
    {
        for (j = 0; j < 5;j++)
        {
            printf("b[%d][%d] = %d   ", i, j, *(*(p + i) + j));
        }
        printf("\n");
    }
}
