/*-------------------------------------------------------------------------
【程序设计】
---------------------------------------------------------------------------
题目：主函数二维数组str[4][6]中存放了数字字符串，程序将str中的数字字符串转
      换为5个10进制正整数。然后计算这5个正整数的最大公约数和最小公倍数。

编写函数：
1.void abstract(char str[][6],int a[])对str中的数字字符串转换为5个10进制正
  整数保存在一维数组a中。这5个正整数分别为4270、140、2135、14、8540。

2.void n_gl(int a[],int gl[])计算a中5个正整数的最大公约数和最小公倍数，
  保存在数组gl中。

程序运行结果如下：
4270        140        2135        14        8540
最大公约数=    7
最小公倍数= 8540
---------------------------------------------------------
注意：请勿改动主函数main()中的任何语句。
-------------------------------------------------------*/
#include<stdio.h>
#include<stdlib.h>
void abstract(char str[][6],int a[]){
/**********Program**********/




/**********  End  **********/
}
void n_gl(int a[],int gl[])
{
/**********Program**********/




/**********  End  **********/
}
int main()
{
    char str[4][6] = {{"40208"},{"21105"},{"74314"},{"00540"}};
    int i,a[5],gl[2];
    FILE *fp;
    if((fp=fopen("DATA.dat","w"))==NULL)
    {
        printf("File open error\n");
        exit(0);
    }
    abstract(str,a);
    for(i=0;i<5;i++)
    {
        printf("%d\t", a[i]);
        fprintf(fp,"%d\t",a[i]);
    }
    n_gl(a,gl);
    printf("\n最大公约数=%6d\n最小公倍数=%6d\n", gl[0],gl[1]);
    fprintf(fp,"\n最大公约数=%6d\n最小公倍数=%6d\n", gl[0],gl[1]);
    fclose(fp);
    return 0;
}