/*----------------------------------------------------------------------
【程序填空】
------------------------------------------------------------------------

题目：以下程序的功能是删去一维数组s中所有相同的数，使之只剩一个。数组中
      的数已按由小到大的顺序排列，函数返回删除后数组中数据的个数。

例：若一维数组中的数据是：
2 3 3 3 3 4 4 4 4 4 10 10 10 10 13 13 15 15 18 18
结果是：2 3 4 10 13 15 18

-----------------------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他部分。
---------------------------------------------------------------------*/
#include <stdio.h>
int del(int s[],int n)
{
    int i,j=1;
    for(i=1;i<n;i++)
/**************************SPACE*************************/
        if(【?】)
            s[j++]=s[i];
    return j;
}

int main()
{
    int s[]={2,3,3,3,3,4,4,4,4,4,10,10,10,10,13,13,15,15,18,18};
    int i,m,n=sizeof(s)/sizeof(int);
    printf("The original data:\n");
    for(i=0;i<n;i++)
        printf("%d ",s[i]);
/**************************SPACE*************************/
    【?】;
    printf("\nThe data after delete:\n");
    for(i=0;i<m;i++)
        printf("%d ",s[i]);
    printf("\n");
    return 1;
}
