/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：在主函数中main()中输入年、月、日，然后计算该天是这一
      年的第几天。其中函数LeapYear()是判断某年是否为闰年。

下面给定的程序存在错误，请改正。

---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/

#include <stdio.h>
#include <conio.h>
int LeapYear(int year){
/***********FOUND***********/
    return ((year%4==0 && year%100) && (year%400==0));
}
int main(){
    int mon_days[2][11]={{31,28,31,30,31,30,31,31,30,31,30},{31,29,31,30,31,30,31,31,30,31,30}};
    int year,mon,day,days;
    int i;
    scanf("%d %d %d",&year,&mon,&day);
    days=day;
/***********FOUND***********/
    for(i=0;i<mon-2;i++)
/***********FOUND***********/
        days=mon_days[LeapYear(year)][i];
    printf("%d\n",days);
    getch();
    return 0;
}