/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：主函数main()中字符串s是由若干个八进制形式的数字字符
      串与'$'字符组成。程序先将每个八进制形式的数字字符串
      转换成十进制数值（每个数值都对应一个ASCII码字符），
      并依次存入数组t中，然后将t中存放的字符串逆序。

例如：
      s串为"$162$145$164$165$160$155$157$143$"，经转换后，
      t中的字符串为"retupmoc",逆序后为"computer"。

编写程序：
      1、编写int abstract(char s[],char t[])函数: 将字符
         数组s中的所有八进制形式的数字字符串转换成十进制
         数值并存入字符数组t中。函数返回字符串t的长度。

      2、编写void reverse(char t[],int len)函数：将长度为
         len的字符串t逆序。

---------------------------------------------------------
注意：请勿改动主函数main()中的任何语句。
-------------------------------------------------------*/

#include <stdio.h>
#include <stdlib.h>
int abstract(char s[],char t[]){
/**********Program**********/



/**********  End  **********/
}

void reverse(char t[],int len){
/**********Program**********/



/**********  End  **********/
}

void main(){
        char s[100]={"$164$163$145$124$40$145$147$141$165$147$156$141$114$40$103$"};
        char t[100];
        int len;
        FILE *fp;
        len=abstract(s,t);
        reverse(t,len);
        if((fp=fopen("data.txt","w"))==NULL){
          printf("File open error\n");
          exit(0);
        }
        printf("%s\n",t);
        fprintf(fp,"%s\n",t);
    fclose(fp);
}