/*-------------------------------------------------------
【程序改错】
---------------------------------------------------------

题目：函数main()首先从键盘接收10个整数，依次存放在a数组中；
      其次，调用fun()函数在这10个整数中找出第一个奇数，并
      返回该数的下标值，如果在这10个数中无奇数，则返回-1；
      第三，如果fun()函数返回值不等于-1则把找到的数与第1个
      数对换位置。

下面给定的程序存在错误，请改正。

---------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
--------------------------------------------------------*/

#include<stdio.h>
#define N 20
int fun(int a[])
{
        int i;
        for (i=0; i<10; i++)
        { 
/***********FOUND***********/
                if (a[i] & 1 == 0)
                        break;
        }
/***********FOUND***********/
        if (i<=10) return 1;
        else return -1;
}

main()
{
        int a[N], i, r, step;
        for (i=0; i<10; i++)
        {
/***********FOUND***********/
                scanf("%d",a[i]);
        }
        r = fun(a);
        if (r!=-1)
        {
                step = a[r];
                a[r] = a[0];
                a[0] = step;
        }
        for(i=0;i<10;i++)  
            printf("%d ",a[i]);
        printf("\n");
        return 0;
}