/*-------------------------------------------------------
【程序填空】
---------------------------------------------------------

题目：随机产生10个范围在[0,99]之间，互不相同的正整数存入
      数组t，并求出这10个数据的最小值和次小值。其中最小值
      存入min1，次小值存入min2。程序中rand()函数功能是产
      生一个随机正整数。

---------------------------------------------------------
注意：请勿改动主函数main()中的其他内容。
-------------------------------------------------------*/

#include <stdio.h>
#include <stdlib.h>
void main(){
  int n[100]={0},t[10];
  int i=0,k;
  int min1=100, min2=100;
  srand(32767);
  while(i<10){
    do{
      k=rand()%100;
    }while(n[k]);
    n[k]=1;
/***********SPACE***********/
    t[【?】]=k;
  }
  for(i=0;i<10;i++){
      printf("%d\t",t[i]);
      if(t[i]<min1){
/***********SPACE***********/
        【?】;
         min1=t[i];
      }
      else if(t[i]<min2)
         min2=t[i]; 
  }
  printf("\nmin1= %d,min2= %d\n",min1,min2);
}